const sentencesArrayMarathi = [
  "गुढीपाडवा म्हणजे हिंजू नववर्षाचा पहिला दिवस. हा सण चैत्र शुद्ध प्रतिपदेला साजरा करण्यात येताे. संपूर्ण भारतात व प्रामुख्याने महाराष्ट्रात माेठ्या उत्साहाने हा सण साजरा केला जाताे. नववर्षाचे स्वागत करण्यासाठी घराच्या दारासमाेर गुढी उभारली जाते. गुढी उभारण्यासाठी लांब बांबूच्या टाेकाला रेश्‍मी वस्त्र बांधले जाते. त्यावर साखरेची माळ, कडुलिंबाची पाने, आंब्याच्या डहाळ्या व झेंडूच्या फुलांचे हार बांधल जाते व त्यावर एक कलश ठेवला जाताे. ही गंढी आकाशाच्या दिशेले उभारली जाते. या गुढीला विजयाचे प्रतीक मानले जाते. चाैदा पर्षांचा वनवास संपवून प्रभू श्रीराम जेव्हा अयाेध्या आले व त्यांचे राजभिषेक झाले तेव्हा हा सण साजरा केला गेला असे मानले जाते. गुढीपाडव्याच्या दिवशी कडुलिंबाच्या काेवळ्या पानांचे सेवन करण्याची पद्धत आहे. यामुळे रक्त शुद्ध हाेते व शरीराची राेगप्रतिकारक शक्ती वाढते. या दिवशी अनेक कुटुंबात पुरणपाेळी किंवा श्रीखंड पुरीचा छान बेत असताे. झालं गेलं विसरून आयुष्याला नव्या उत्साहाने व आनंदाने सामाेरे जावे हाच संदेश गुढीपाडव्याचा सण आपलला देत असताे. गुढीपाडवा हा भारतीय संस्कृतीतला एक महत्त्वाचा सण आहे. हिंदू दिनदर्शिकेप्रमाणे चैत्र शुद्ध प्रतिपदेला म्हणजेच वसंत ऋतूचा पहिल्या दिवशी ही सण साजरा केला जाताे. नववर्षाचा हा पहिला दिवस अतिशय पवित्र मानला जाताे. वसंत ऋतूची चाहूल देणारा हा गुढीपाडवा संपूर्ण भारतात माेठ्या उत्साहाने साजरा केला जाताे. व जास्ती करून महाराष्ट्रतात प्रभू रामचंद्रानी रावणाचा पराभव करून वनवास संपून आयाेध्या नगरी मध्ये प्रवेश केला. त्या दिवशी श्रीरामाचे स्वागत करण्यासाठी आयाेध्येतील प्रजेने गुढ्या, ताेरण उभारली हाेती आणि आनंद साजरा केला हाेता. तीच प्रथा वर्षानुवर्षे चालत आली म्हणून. आजही घराेघरी गुढी उभारली जाते. दारासमाेर सुबक रांगाेळी काढली जाते. या नवीन वर्षाचे स्वागत करण्यासाठी घराच्या दारासमाेर गुढी उभारली जाते. गुढी उभारण्यासाठी लांब काठी घेऊन तिच्या टाेकावर जरीचे किंवा रेशमी वस्त्र बांधले जाते. त्यावर कडुलिंबाचे पाने, रंगीबिरंगी बत्ताश्‍याची माळ, आंब्याच्या डहाळ्या फुलांच्या माळा बांधल्या जातात. आणि त्या वर एक कलश ठेवला जाताे. ती गुढी बांधून तिची पूजा केली जाते.",
  "आजचे आधूनिक युग माेबाईल व संगणकाचे युग आहे. आजचे जग माेबाईल शिवाय अपूर्ण आहे. मनुष्याने लावलेल्या शाेधांमध्ये माेबाईल हे एक महत्त्वाचे साधन आहे. आजकाल दिवसाची सुरुवात माेबाईलनेच हाेते. व्यवसाय नातेवाईक व मित्र मंडळी शी संपर्क करण्यासाठी माेबाईल चा वापर केला जाताे. तरुणांमध्ये तर माेबाईल चे चलन दिवसेंदिवस वाढत आहे. पण तुम्ही कधी विचार केला आहे की जर माेबाईल नसता तर. आज जर माेबाईल नसता तर आजचे हे युग आधुनिक युग म्हटले गेले नसते. कारण आजच्या आधूनिक युगाला परिवर्तित करण्यासाठी माेबाईल ची भूमिका महत्त्वाची आहे. विकासाच्या मार्गावर आज सर्वच वस्तू डिजिटल झाल्या आहेत. माेबाईल नसता तर डिजिटल क्रांती आणणे शक्य झाले नसते. कारण माेबाईलच्याच मदतीने पैश्‍यांची देवाण घेवाण हाेते. माेबाईल नसता तर नातेवाईक, मित्र तसेच व्यावसायिक लाेकांना संपर्क करणे शक्य झाले नसते. आजकाल प्रत्येक वस्तू स्मार्टफाेन मध्ये उपलब्ध आहे. जगभराची माहिती घरबसल्या माेबाईल मुळे मिळवणे शक्य हाेते. परंतु जर माेबाईल नसता तर जगात काय काय नवीन घडत आहे हे लक्षात आले नसते. ऑनलाईन शाॅपिंग आज माेठ्या प्रमाणात वाढत आहे माेबाईल नसल्यावर शाॅपिंग देखील करता आली नसती. आजकाल ज्या लाेकांना रस्ता माहित नसताे ते गुगल मॅप मदतीने एका जागेहून दसऱ्‍या जागी पाेहाेचतात. परंतु जर माेबाईल नसता तर लाेकांना परत परत इतरांना विचारात मार्ग शाेधावा लागला असता. ज्याप्रमाणे माेबाईल नसण्याचे दुष्परिणाम आहेत त्याच पद्धतीने याचे काही फायदेही आपल्याला मिळाले असते. आज लाेकांना अति माेबाईल वापराचे व्यसन जडत आहे. माेबाईल मध्ये दीर्घकाळ गेम खेळणे इंटरनेटचा वापर करणे यामुळे डाेळ्यांना त्रास हाेताे. डाेकेदुखी, डाेळे चुरचुरणे या सारख्या समस्या निर्माण हाेत आहेत. माेबाईल च्या मदतीने वाईट बुद्धीचे लाेक हॅकिंग करून लाेकांची माहिती चाेरतात व त्याचा चुकीचा वापर करतात. जर माेबाईल नसते तर ऑनलाईन हॅकिंग झाली नसती. आजकाल माेबाईल मुळे ब्लॅकमेलिंग चे प्रमाणही वाढले आहे. शेवटी येवढेच सांगता येईल की माेबाईल वापराचे फायदे तर आहेत परंतु याचे दुष्परिणाम देखील माेठ्या प्रमाणात आहेत.",
  "जगभरातील लाेकांद्वारे वेगवेगळे पाळीव प्राणी पाळले जातात. माझा आवडता प्राणी ससा आहे. आम्ही आमच्या फार्म मध्ये ससे पाळले आहेत. ससा हा खूपच सुंदर दिसताे, त्याचा स्वभव चंचल असताे व ताे दिवसीार इकडून तिकडे उड्या मारीत असताे. लहान मुलांना तर ससे खूपच अउवडतात. जगभरात संशांच्या जवळपास ३०५ प्रजाती आढळतात. अंटार्टिका ला साेडून हा प्राणी प्रत्येक खंडात आढळताे. दक्षिण अमेरिकेमध्ये सशाच्या सर्वात जास्त प्रजाती आहेत. सशाचे स्नायू खूपच लवचिक असतात, यामुळे ताे लांब उड्या मारू शकताे. सशाच्या पायातील नखे खूपख् मजबूत व धारदार असतात. या नखांच्या मदतीने ताे जमितीत बिळ करताे. सश्‍याचा आकार मांजरी सारख लहान असताे. याचे पूर्ण शरीर लहान केसांनी झाकलेले असते. या केसामुळे थंडीच्या ऋतूत त्याचे रक्षण हेाते. ससे हे भुर, काळे आणि पांढऱ्‍या रंगाचे असतात. सशाचे कान व नाक खूप तेज असतात. सशाला एक लहान शेट्टी पण असते. सशाच्या ताेंडात २८ दात असतात, या दाताच्या मदतीने ते आपल्या भाेजनाला कुरतडून खातात. ससे हे जास्त करून इतर सश्‍यासाेबत राहणे पसंद करतात. सशांच्या जास्त करून प्रजाती जंगलात आढळतात. ससे हे जमिनीच्या खली खड्डे करून राहणे पसंद करतात. ससा शाकाहारी प्राणी आहे. ताे जास्त करून हिरवे गवत, फळे, गाजर, मुळा खाणे पसंद करताे. सशांच्या जीवन काल आठ ते दहा वर्षांचा असताे. ससा हा अतिशय गाेंडस प्राणी आहे. बरेच मांसाहारी लाेक सशांना मारून खातता. असे करणे याेग्य नाही खाण्यासाठी दुसरे चांगले चांगले पदार्थ पण आहेत. म्हणून माझी सर्वांना विनंती आहे की ससे व अन्य पाळीव प्राण्यांचे रक्षण आपण करायला हवे. मला ससा हा खुप आवडताे व माझा आवडता प्राणी ससे आहे. ससा हा अतिशय शांत व चंवल स्वभावाचा प्राणी आहे. सशाचे कान लांब असतात. ससे अतिशय चंचल असतात यामुळे ते दिवसभर फिरतात. सशांचे डाेळे गाेल गाेल असतात. ससे भारतासह जगभरात पाळले जातात. इकडुन तिकउे उड्या मारत असतात जगभरात सशांच्या वेगवेगळ्या प्रजाती आहेत यातील काही प्रजाती जंगलात असतात. सशाचे वजन २-३ किलाे पर्यंत असते. त्यांची उंची २० इंच पर्यंत असते. ससा हा अतिशय भितरट प्राणी आहे.",
  "विज्ञानाच्या या युगात मानवाला ज्याप्रमाण काही वरदान मिळाले आहे त्याच पद्धतीने त्याला काही दुष्परिणाम पण भाेगावे लागले आहेत आणि या दुष्परिणामांना सहन करण्यासाठी आजही जनता मजबूर आहे. आज पृथ्वीवर वाढत असलेला समस्यांमध्ये प्रदूषण ही सर्वात माेठी समस्या आहे. प्रदूषणाचा अथ्र हाेताे नैसर्गिक संतुलनात दाेष निर्माण हाेणे. श्‍वसा श्‍वासासाठी शुद्ध हवा न मिळणे, प्यायला स्वच्छ पाणी न मिळणे, स्वच्छ अन्न न मिळणे आणि शांत वातावरण न उपलब्ध हाेणे. प्रदूषण मानवाजातीसाठी किती हानिकारक आहे हे सर्वानाच माहीत झाले आहे. परंतु हे ज्ञान फक्त पुस्तकापर्यंत सिमीत आहे. वास्तविक जीवनात मनुष्य आपली प्रगती आणि सुख सुविधामध्ये वृद्धी करण्यासाठी दिवसेंदिवस प्रदूषण करीत आहे. पृथ्वी, पाणी, हवा, ध्वनि इत्यादींमध्ये आढळणारे तत्व जर असंतुलित असतील तर याला प्रदूषण म्हटले जाते. मनुष्याद्वारे निर्माण झालेला कचरा व टाकाऊ पदार्थ जे निसर्गात फेकले जातात तया पदार्थांना ‘प्रदूषण‘ म्हटले जाते. प्रदूषण अनेक प्रकारचे असते. प्रदूषणाचे काही प्रमुख प्रकार पुढील प्रमाणे आहेत. जल प्रदूषण, वायू प्रदूषण आणि ध्वनि प्रदूषण भारतातील माेठमाेठ्या महानगरामध्ये वायू प्रदूषण माेठ्या प्रमाणात पसरत आहे. चाेवीस तास चालणारे कारखाने, गाड्या माेटारी इत्यादी मधून निघणारा काळा धूर वायुप्रदूषण वाढवण्याचे कार्य करताे. दिल्ली-मुंबई सारख्या माेठ्या शहरांमध्ये श्‍वास घेणे सुद्धा कठीण आहे. माेठ्या प्रमाणात वायू प्रदूषण वाढल्याने श्‍वास संबंधी विकार जाडतात. वायू प्रदूषण राेखण्यासाठी अधिकाधिक झाडे लावायला हवी. गाड्या माेटारीचा कमीत कमी वापर करायला हवा. वायू प्रदूषण नंतर दुसरी सर्वात माेठी समस्या म्हणजे जल प्रदूषण हाेय. कारखान्यांमधून निघणारे दूषित पाणी नदीत साेडले जाते हे पणी प्यायल्याने मनुष्य व प्राण्यांना आनेक राेग जडतात. दूषित पाणी पिल्यानं बऱ्‍याचदा मृत्यू ही हाेऊन जाताे. यामुळे सरकार तसेच नागरिकाचे हे कर्तव्य आहे की त्यांनी आपल्या आजूबाजूचा नदी व पाण्याचा परिसर स्वच्छ ठेवायला हवा. जल प्रदूषणां नंतर सर्वात माेठी प्रदूषण समस्या म्हणजे ध्वनी प्रदूषण हाेय. ध्वनी प्रदूषण कारखाने, गाड्या माेटारी, लाऊड स्पीकर इत्यादीच्या आवाजामुळे वाढत आहे. ध्वनी प्रदूषणामुळे बहिरेपणा सारख्या समस्या वाढत आहेत. सतत माेठ्या प्रमाणात कर्कश आवाज ऐकल्याने मानसिक तणाव वाढताे. म्हणून ध्वनी प्रदूषण कमी करण्यसाठी कारखाने व नागरिकांनी उच्च दर्जाची मशीने वापरायला हवी.",
  "मी एक नदी आहे. नदी हा शब्द तुम्हाला तर परिचितच असेल. पण तरीही मी आज तुम्हाला माझा परिचय देणार आहे मी काेण आहे. कुठून आले आहे. माझे अस्तित्व काय आहे. भारतासह मला जगभरात वेगवेगळ्या नावांनी ओळखले जाते. जसे सरिता, जीवनदायिनी रिव्हर इत्यादी. स्वभावत: मी खूप चंचल आहे परंतु कधीकधी शांत देखील हाेऊन जाते. खळखळ करत मी वाहत राहते. सतत न थांबता, न अडकता मी वाहते. माझा जन्म पर्वतांमध्ये झाला हाेता, तेथून झऱ्‍यांच्या मदतीने मी जंगल आणि गावांमधून वाहत वाहत पुढे समुद्राला हाेता, पुढे समुद्राला जाऊन मिळते. माझ्या प्रवाह कधी कमी तर कधी जास्त हाेताे. माझा आकार स्थानानुसार कधी लहान तर कधी माेठा हाेत असताे. माझ्या मार्गात खूप अडचणी येतात, कधी दगड गाेटे तर कधी माेठ माेठ पर्वत पण मी कधीही थांबत नाही. माझा मार्ग मी स्वत: तयार करून वाहत राहते. मनुष्य अनेक प्रकारांनी माझ्याशी जुळलेला आहे. तुम्ही असेही म्हणू शकतात की मी मनुष्यासाठी खूप उपयुक्त आहे. मनुष्याला अनेक पद्धतीने जीवन जगण्यासाठी मी मदत करते. माझ्या पाण्यात अनेक जलचर जीवजंतू राहतात मनुष्य त्यांना पकडून खाताे. अश्‍या पद्धतीने मी मनुष्याची अन्नाची भूक भागवते. माझ्यामुळे भूतलावावरील सर्व घरांमध्ये पाण्याची व्यवस्था हाेते. मनुष्याला दैनंदिन जीवन जगण्यासाठी पणी हे अतिशय उपयुक्त आहे. मी पर्यावरणाचे संतुलन राखण्यात मदत करते. माझ्या पाण्याच्या मदतीने मनुष्य वीन तयार करताे आणि याच विजेच्या मदतीने अनेक उपकरणे कार्य करातात. शेतकरी माझे पाणी शेतात पिकांसाठी वापरताे, ज्यामुळे शेतातील पिके लहरायला लागतात. जंगलातून वाहताना मी जंगली पशु पक्ष्यांची तहान भागवते व यासाेबतच जंगलातील झाडांना पाणी पुरवठा करते. माझ्या बद्दल सांगायचे झाले तर मलाही भावना आहेत, मला देखील आनंद व दु:ख हाेते आणि मनुष्य मला अतिशय लाेभी जाणवताे. आपले स्वार्थ पूर्ण करण्यासाठी ताे काहीही करू शकताे. मनुष्या द्वारे मला देवीच्या रूपात पूजले जाते, लाेक त्यांच्या इच्छा पूर्ण करण्यासाठी मला प्रार्थना करतात, उपवास ठेवतात, फुले चढवतात. आणि मग दुसरी कडे तेच माझ्या पाण्यात कचरा व घाण टाकतात, मला प्रदूषित करतात. आता तुम्हीच सांगा की काेणी देवीला प्रदूषित करत का माझी इच्छा फक्त एवढीच आहे की जर मनुष्य मला देवी मानत असेल तर त्याने मला प्रदूषित कारायला नकाे.",
  "मी वाचलेल्या व मला सर्वाधिक प्रिय असणाऱ्‍या पुस्तकाचे नाव अग्निपंख आहे. हे पुस्तक भारताचे भूतपूर्व राष्ट्रपती डाॅक्टर एपीजे अब्दुल कलाम यांनी लिहिले आहे. अग्निपंख ही एपीजे अब्दुल कलाम यांची आत्मकथा आहे. या पुस्तकात अब्दुल कलाम यांच्या बालपणापासून तर राष्ट्रपति पदापर्यंतचा संपूर्ण प्रवास रचण्यात आला आहे. डाॅक्टर अब्दुल कलाम भारताच्या यशस्वी शास्त्रज्ञापैकी एक आहेत. त्यांनी इंडियन स्पेस रिसर्च ऑर्गनायझेशन मध्ये महत्त्वाचे याेगदान दिले. भारताची सैन्य क्षमता वाढविण्यासाठी त्यांनी अनुचाचणी घेतली म्हणूनच त्यांना मिसाईल मेन म्हणूनही संबाेधले जाते. २००२ सालापर्यंत ते अत्यंत लाेकपि्रय झाले हाेते. म्हणूनच त्यांना भारताच्या राष्ट्रपतीपदासाठी निवडण्यात आले. अग्निपंख या पुस्तकात अब्दुल कलाम यांनी यांचे बालपणचे जीवन ते राष्ट्रपती पदासाठी करण्यात आलेली निवड पर्यंतचा संपूर्ण जीवन परिचय रेखाटला आहे. या चारित्र्याची सुरुवत एका लहान मुलापासून हाेते जाे नंतर इस्त्राे चा प्रसिद्ध शास्त्रज्ञ आणि भारताचे राष्ट्रपती बनताे. मला या पुस्तकातील सुरुवातीचे धडे जास्तीत आवडले कारण या धड्यांमध्ये भारताच्या १९३०-१९५० या कालखंडातील परिस्थिचे चित्रण करण्यात आले आहे. अब्दुल कलाम यांचा जन्म धार्मिक नगरी रामेश्‍वरम मधील एका मुस्लिम कुटुंबात झाला. भारताच्या विभाजनापूर्वी असलेली देशातील धार्मिक एकता आणि एकत्मतेचे वर्णन अब्दुल कलाम यांनी पहिल्या दाेन धड्यांमध्ये केले आहे. अब्दुल कलमा यांनी आपल्या पुस्तकात लिहिले आहे की लहान असताना त्यांचे स्वप्न पायलट बनण्याचे हाेते. परंतु पायलट साठी असलेली इंटरव्यू परीक्षा ते अनुत्तीर्ण झाले. परंतु निराश न हाेता त्यांनी दुसऱ्‍या क्षेत्रात आले करियर सुरू केले. पुस्तकात सांगितल्याप्रमाण्र कलाम यांनी सुरवातीला विमान बनवण्याचे क्षेत्रात कार्य केले. नंतर ते भारतीय अंतराक्ष संस्था इस्त्राे कडे वळले. अग्निपंख पुस्तकात अब्दुल कलाम यांनी यशस्वीपणे पूर्ण केलेले सॅटॅलाइटआणि मिसाइल कार्यक्रमांची माहिती देण्यात आली आहे. अग्नी, आकाश, पृथ्वी, त्रिशूल, नाग या घराेघरी पाेहाेचलेल्या नावांच्या क्षेपणास्त्रांची जडणघडणही फार सुंदरपणे वाचकांना सांगितलेली आहे. हे पुस्तक केवळ डाॅ. अब्दुल कलाम यांचे आत्मचरित्र नसून स्वतंत्र भारताच्या तंत्रज्ञानविषयक लढाईचे एक स्पंदन आहे.जागतिक शस्त्रस्पर्धेच्या राजकारणाची आणि विज्ञानाची ती काहणी आहे. तसेच स्वयंपूर्ण हाेण्यासाठी आपल्या देशाने केलेल्या संघर्षाचे ते मनाेहारी खंडकाव्यही आहे.",
  "वाचनाच्या सवयी ज्वलंत कल्पनाशक्ती, ज्ञान आणि शब्दसंग्रह विकसित करतात. चांगल्या वाचनाच्या सवयींचे वर्णन करणारे काही मुद्दे येथे आहेत. वाचनाचे सर्वात महत्त्वाचे कारण म्हणजे आपल्याला ज्ञान मिळते. पुस्तके ही माहिती आणि ज्ञानाचा समृद्ध स्त्राेत आहे. विविध प्रकारच्या शैलींवरील पुस्तके वाचल्याने माहिती मिळते आणि आपण वाचलेल्या विषयाची सखाेल माहिती मिळते. जेव्हा तुम्ही वाचता तेव्हा तुम्ही नेहमी काहीतरी नवीन शिकता. हे सिद्ध सत्य आहे की ज्या लाेकांना वाचनाच्या चांगल्या सवयी आहेत त्यांच्यामध्ये उच्च बुद्धिमत्ता दिसून येते. वैविध्यपूर्ण आणि समृद्ध शैली असलेली पुस्तके मन माेकळे करतात. आणि सर्जनशील क्षमता आणि भाषा काैशलये वाढवतात. काल्पनिक कथा वाचलयाने सहानुभूती निर्माण हाेते आणि इतरांशी चांगले संबंध निर्माण करण्यात मदत हाेते. तुम्ही कथेचा भाग बनता आणि नैसर्गिकरित्या पात्रांबद्दल सहानुीाूती आणि सहानुभूती बाळगता. वेगवेगळया परिस्थितींमध्ये लाेकांचा कसा परिणाम हाेताे याबद्दल तुम्ही अधिक जागरूक झाला आहात. हे इतरांशी सहानुभूती दाखवण्याची तुमची एकुण क्षमता वाढवते. चांगलं वाचनही तुम्हाला लिहायला प्रवृत्त करते. अधिकाधिक वाचन करून अनेक लेखकांना प्रेरणा मिळते आणि प्राविण्या प्राप्त हाेते. तुम्ही भाषा वापरण्याची कला शिकता आणि शब्दांशी खेळण्याचा आनंद घेता. वाचन ही एक प्रकारची प्रेरणा आहे जी तणावमुक्त करण्यासाठी एक अभ्दुत कार्य करते. प्रेरणादायी पुस्तके वाचणे खराेखरच आपले जीवन बदलू शेतक. चरित्रे वाचणे आपल्याला कठाेर परिश्रम करण्यास आणि आपले ध्येय साध्य करण्यासाठी समर्पित राहण्यास देखील प्राेत्साहित करू शकते. हे आपल्याला जीवनात एक चांगले व्यक्ती बनण्यास मदत करते. वाचनाची सवय लावण्याचे अनेक फायदे आहेत. हे तुमचे मन सक्रिय, मजबूत आणि निराेगी ठेवते. तुमच्या एकूण वैयक्तिक वाढीसाठी आणि विकासासाठी वाचन महत्त्वाचे आहे. शिवाय तुम्हाला वाचनाच्या चांगल्या सवयी लागल्यास, तूम्हाला कधीही कंटाळा किंवा एकटेपणा वाटत नाही. पुस्तकांच्या माध्यमातून काम करणारे अनेक लाेक त्यांचे अनुभव जीवनात समाविष्ट करतात. ते म्हणतात की पुस्तके वाचून खूप फायदा हाेताे. कादंबरी, कथा, कविता इत्यादी वाचून आपने मनाेरंजन हाेते, मनाला शांती मिळते. आपण वाचलेल्या प्रत्येक गाेष्टीची कल्पना करण्याचा प्रयत्न करताे. वाचन हा आपलया मनाचा आराेग्याचा व्यायाम आहे. वाचनाने आपल एकाग्रता शक्ती वाढते. हे आपले भावनिक आराेग्य देखील सुधारते.",
  "कला हा एक संस्कृत शब्द आहे. मानवी जीवनात कलेचे महत्व अनन्यसाधारण आहे. इतिहास व आपल्या संस्कृतीत कलेचा संबंध हा साैंदर्य, सुंदरता आणि आनंदाशी आहे. आपलया मनातील भावनांना साैंदर्यासाेबत दृश्‍य रूपात व्यक्त करणे म्हणजेच कला हाेय. कलेचे अनेक प्रकार आहेत. चित्र, नृत्य, मुर्ती, वाद्य, साहित्य, लेखन, संगीत, काव्य इत्यादी कलेचे काही प्रमुख प्रकार आहेत. परंतु माझी आवडती कला साहित्य कला आहे समाजाला कल साहित्य बनवण्यासाठी सुदृढता महत्त्वाची कामगिरी बजावते हे साहित्य जसे की, आधुनिक व प्राचीन कला जागृत करते. संवेदना समाजात साहित्य निर्माण करते, काळातील महाकाव्य आणि पवित्र ग्रंथ साहित्य म्हणूनच ओळखले जातात. समजले घटनांना ऐतिहासिक आणि इतिहास मदतीनेच साहित्यास मदत मिळते. साहित्याच्या मदतीने आपण आपल्या विचारांना लेखणी द्वारे लिहू शकताे. आपलया देशात असे अनेक महान व्यक्ती हाेऊन गेलेत ज्यांनी साहित्य केलच्या माध्यमाने अनेक प्रसिद्ध कविता, उपन्यास, गाेष्टी, निबंध आणि कादंबरी लिहीलया आहेत. निर्जीव पात्रांना सजीव करण्याची शक्ती साहित्य कलेत आहे. खरे साहित्य तेच असते ज्यात उच्च चिंतन असते, साैंदर्याचा विचार असताे. स्वाधीनतेचा भाव असताे, सूर्जन करण्याची आत्मा आणि जीवनाची सत्यता असते. मला देखील कविता व लेख लिहायला आवडते मी स्थानिक सामाजिक व शैक्षणिक विषयांवर वृत्तपत्रात अनेकदा लेख लिहून पाठवले आहेत धूम्रपानाने हाेणारे दुषपरिणाम या विषयावरील लेखामुळे मला मी लिखाण केले आहे. ५०० रुपये मानधन देखील म आले हाेते. मी दरराेज काही न काही लिहीत असताे माझे भविष्यात एक आदर्श लेखक बनणे आहे. लेखन करणे हा माझा छंदच आहे. साहित्य जगाला एका नवीन पद्धतीने पाहण्याची क्षमता प्रदान करते साहित्य वाचकाला विश्‍वास प्रदान करते. त्याला नैतिक शिक्षण देऊन याेग्य निर्णय घेण्यासाठी शिकवण व प्राेतसाहन देते वर्तमान काळात साहित्याने लाेकांच्या मनात मानवता आणि जिज्ञासा निर्माण केली आहे. अनेक पुस्तकालयांना युगात लिहीले गेले त्याच युगाला प्रतिबिंबित साहित्य निर्माण केले आहे. साहित्याच्या अध्ययनाने आपण या विशिष्ठ काळातील विशेष गाेष्ट करताे. साहित्य समजून शकताे जेव्हा आपण साहितया अध्ययन करताे तेव्हा याेग्य भाषेची शैली आत्मसात करताे.आलया लक्षात येते कले शिवाय जीवन व्यथीत करणाऱ्‍या व्यक्तीला आपल्या संस्कृतीत पशू म्हटले जाते.",
  "आपल्या देशात विविध भागांमध्ये जत्रेचे आयाेजन केले जाते. यामधून काही जत्रा या धार्मिक असतात तर काही राष्ट्रीय. प्रत्येक लहान माेठ्या खेड्या तसेच शहरी भागात जत्रेचे आयाेजन केले जाते. माझ्या गावचे नाव भैरवी गाव आहे. हे गाव पुण्याजवळ स्थित आहे. माझ्या गावात दरवर्षी श्रावण महिन्यात जत्रा भरते. ही जत्रा भगवान शंकराच्या मंदिर परिसरात भरते. गावची जत्री म्हटली म्हणजे एक वेगळाच उत्साह वाटताे. श्रावण महिन्याची ही जत्रा श्रावण साेमवारी भरते. श्रावण महिना सुरू हाेण्याअगाेदरच मंदिरातील साफसफाई सुरू हाेते संपूर्ण जागा स्वच्छ केली जाते. आणि मग ताे जत्रेचा दिवस देखील उजाडताे. दरवर्षी मी माझे मित्र तसेच कुटुंबासाेबत जत्रेत फिरायला जाताे. गामील वर्षी देखील जत्रेच्या सकाळीच मला माझ्या मित्राचा फाेन आला ताे, मी आणि माझा शेजारी मित्र असे आमचा तिघांचा जत्रेत साेबत जाण्याचा बेत ठरला. जत्रेची विशेष शाेभा संध्याकाळ च्या वेळी पाहायला मिळत असते. जेव्हा आम्ही गावाच्या जत्रा मैदानात पाेहाेचलाे, पाहताे तर काय या वर्षी ताेबा गर्दी जमली हाेती गावातील भगवान. पाय ठेवायला देखील जागा शिल्लक नव्हती. माझ्या वडिलांनी मला आधी. शंकराचे मंदिर जत्रे पासून थाेडे दूर टेकडीवर हाेते म्हणून आम्ही तिघे जन कशीतरी. मंदिरात जाऊन दर्शन घ्यायला सांगितले हाेते वाट काढत शिखरावर पाेहाेचलाे भगवान शंकराचे दर्शन घेतले व वरून जत्रा मैदान चारही बाजूंनी दुकान. वरून जत्रेचे दृश्‍य अतिशय सुंदर दिसत हाेते. पाहिले जत्रेत खाण्यापिण्याची साेय लावली आणि सर्वजण आनंदी हाेते, खेळण्यांची, पुस्तकांची अशी वेगवेगळी दुकाने लागली हाेती. याशिवाय जत्रेत अनेक माेठ माेठे झाेके आलेले हाते. आम्ही खली उतरलाे आणि जत्रेत शिरलाे. माझ्या मित्रांनी माेठ्या गाेल फिरणाऱ्‍या झाेक्यात बसण्याची इच्छा व्यक्त केली. म्हणून आम्ही त्या झाेक्यात बसलाे. माझा तर जीव घाबरत हाेता. मी पहिल्यांदा या झाेक्याची स्वारी करणार हाेताे. जसा झाेका सुरू झाला मी माझे डाेळे घट्ट मिटले. सांगितले तेव्हा माझ्या मित्रांनी मला धीर देत डाेळे उघडायला मग मी पण हळू हळू डाेळे उघडले. काही हाेत नाही म्हणून त्यांनी मला समजावले पहिल्यांदा बसल्याने जीव घाबरत. आणि चारही बाजुंचे साैंदर्य पाहायला लागताे. आणि खुप आनंद वाटत हाेता.",
  "आपल्या देशात देवाच्या बाल रुपाची अनेक मंदिरे आहेत. जसे बाल गणेश, हनुमान, श्रीकृष्ण इत्यादी. आपल्या देशात मुलांना देवा घरची फुले म्हटले जाते. ध्रुवबाळ, भक्त प्रलहद, लवकुश, अभिमन्यू या सारखे अनेक बालक भारतीय संस्कृतीत हाेऊन गेलेत. परंतु आजच्या काळात भारतात गरिबी ची स्थिती माेठ्या प्रमाणात आहे. देशातील गरीब मुलांची स्थिती चांगली नाही. बालश्रम व बालकामगार आपल्या देशाची माेठी समस्या आहे. बाल मजुरी मुळे गरीब मुलांच भविष्य अंधकामय हाेत आहे. १४ ते १८ वर्षाच्या लहान मुलांद्वारे काम करून घेणे म्हणजेच ‘बाल मजुरी‘ हाेय. कमी वयात काम करण्याऱ्‍या या मुलांना बालकामगार म्हटले जाते. काेणत्याही राष्ट्राच्या विकासासाठी लरुण व लहान मुलांची शक्ती खूप उपयुक्त असते. परंतु आपल्या देशातील काही लाेक थाेड्या पैशांच्या हव्यासापाेटी आपल्या मुलांना बालमजुरी च्या कामला लाऊन देतात. कमी पैशात कामगार मिळाल्याने हाॅटेल, कारखाने व दुकानीचे मालकही या मुलांना कामावर ठेवून घेतात. आज आपलया देशातील गरीब मुले हाॅटेल, कारखाने, दुकानी, धार्मिक स्थळ व इतर ठिाकणी कामे करतांना दिसतात. काही मुले तर माेठ माेठ्या कारखान्यामध्ये धाेकादायक कामगिरी करतानाही दिसून जातात. भारतीय राज्यघटनेच्या १९५० च्या कलम २४ नुसार १४ वर्षाखालील काेणत्याही बालकाला कारखान्यात काम दिले जातणार नाही. व जर काेण्या कारखान्यात या कायद्याचे उल्लंघन हाेताना आढहले तर भारतीय विधिमंडळाने फॅक्टरी ॲक्ट १९४८ आणि चिल्ड्रेन ॲक्ट १९६९ मध्ये तरतुदी करून फॅक्टरी मालकावर दंड व कारावासाची शिक्षा सुनावली आहे. भारतीच राज्यघटनेच्या कलम ४५ नुसार प्रतयेक राज्य शसनाचे कर्तव्य आहे की त्यांनी आपलया राजयातील विद्यार्थ्यांच्या निशुल्क शिक्षणाची व्यवस्था करावी. बालकामगार व बाल मजुरी ही समस्या फक्त भारतात नसून जगातील अनेक विकसनशील देशत माेठ्या प्रमाणात आहे. गरिबी रेषेखलील आई वडील आपल्या मुलांच्या शिक्षणाचा खर्च करू शकत नाहीत. या शिवाय जीवन जगण्यासाठी पैश्‍यांची देखील आवश्‍यक असते. म्हणूनच आपलया मुलांना शाळेत पाठवण्याची बरीच कमी झाली आहे. भारत शासनाचे हे काम प्रशंसनीय आहे. आपल्या देशात आता प्रथमिक व माध्यमिक शिक्षण माेफत करण्यात आले आहे. या शिवाय शाळेतच मुलांना मध्यान भाेजनाची व्यवस्था करण्यात येते.",
  "आज मानव प्रगतीमुळे पर्यावरण प्रदूषित हाेत आहे. प्राचीन काळात ऋषी मुनी आश्रमा बाहेर अनेक झाडे लावत असत. यामुळेच त्यांचे आयुष्य निराेगी व अनेक वर्षे राहत असे. आपल्या चारही बाजूंना असलेल्या सुंदर निसर्गात परमेश्‍वराने एकाहून एक अद्भूत गाेष्टी बनवल्या आहेत. सुंदर फुले, हिरवी झाडे, वेगवेगळे रंग आणि रूप असलेले पशुपक्षी इत्यादी गाेष्टी आपले मन माेहून घेतात. मानवी जीवनात झाडांचे महत्व विशेष आहे. झाडे मनुष्यासाठी अत्यंत उपयुक्त आहेत, मी मनुष्य जीवनाची आधार आहेत. याशिवाय पर्यावरणाचे संतुलन राखण्यासठी वृक्षांचे महत्त्व भरपूर आहे. परंतु आज मानवाने आपल्या वननवीन शाेधांच्या अभिलाषेमुळे पर्यावरणाला नुकसान पाेहचवणे सुरू केले आहे. अश्‍या काळात पर्यावर संवर्धन ही काळाची गरज झाली आहे. पृथ्वीवरील अनेक प्राणी आपल्या अन्नासाठी वृक्षांवर अवलंबून आहेत. मनुष्य हवेत असलेला ऑक्सिजन हा प्राणवायू श्‍वासाद्वारे ग्रहण करताे. अशा पद्धतीने वृक्ष मनुष्यासाठी अत्यंत उपयुक्त आहेत. मागील काही वर्षांमध्ये देशतील कारखान्यांची संख्या वाढली आहे. या कारखान्यात लागणारा कच्चामाल तसेच देशातील वाढती लाेकसंख्या अश्‍या अनेक गाेष्टी वृक्षताेडीसाठी कारणीभूत आहेत. देशात हाेत असलेला पर्यावरणाचा ऱ्‍हास वेळीच राेखण्यात आला नाही तर येत्या काळात ही खूश्‍प माेठी समस्या बनून जाईल. पर्यावरण संवर्धनाचे महत्त्व समजून जगभरातील देश वृक्षालागवउ व जास्तीतजास्त सीएनजी गॅस चा उपयाेग करू लागले आहेत. पर्यावरण आपले भविष्य आहे म्हणून याच्या संरक्षणासाठी आपल्याला वेळीच लक्ष द्यावे लागेल. पर्यावरणला प्रदूषण मुक्त करण्यासाइी सर्वात आधीजल प्रदूषणाला राेखावे लागेल. कारखान्यांच खराब पाणी, घरातील दूषित पाणी, नाल्यामधून वाहणारा मल इत्यादी समुद्रात जाण्यापासून राेखले गेले पाहिजे. कारखान्यातून निघणारे विषयुक्त पाणी पिऊन जलचर व उभयचर प्राण्यांची मृत्यू हाेत. दुसरी कडे त्याच प्रदूषित पाण्याला शेतात वापरले जाते. व दूषित पाण्यात उगवलेला भजीपाला खाऊन आपले आराेग्य बिघडण्याचा धाेका असताे. म्हणून सांगण्याचे तात्पर्य एवढेच आहे की जर आपल्या उद्याला आराेग्यदायी बनवायचे आहे तर आजपासून प्रयत्न करायला हवे. जर प्रदूषणानंतर वायू प्रदूषणाने पर्यावरणाला खूप हानी पाेहाेचवली आहे. माेठ माेठ्या कारखान्यांच्या चिमण्यांमधून निघणारे धूर, रेल्वे व इतर पेट्राेल, डिझेल वर चालणारी वाहनांमधून निघणारा धूर वायु मंडळात मिसळून वातावरण प्रदूषित करताे. या शिवाय ध्वनी प्रदूषाणाची समस्या ही माेठ्या प्रमाणत आहे .",
  "वाढत्या लाेकसंख्येचा सरळ परिणाम देशातील लाेकांच्या जीवनावर पडताे. स्वातंत्र्या नंतर आपल्या देशात कृषी व उद्याेग क्षेत्रात अभूतपूर्व प्रगती झाली. परंतु या आर्थिक प्रगती नंतरही देशातील प्रतिव्यक्ती उत्पन्न वाढले नाही. वाढत्या लाेकसंख्येने देशाच्या प्रगतीला राेखले आहे. जर एखाद्या देशाची लाेकसंख्या माेठ्या प्रमाणात वाढत असेल तर त्या देशात असलेल्या पायाभूत सुविधा आणि संसाधनांवर दबाव पडताे. वीज, पेट्राेल, डिझेल, परिवहन, अन्न, पाणी, घरे इत्यादी गाेष्टींची मागणी वाढल्यावर त्या गाेष्टींचा तुटवडा निर्माण व्हायला लागताे. परिणामी महागाई वाढून देश गरिबीच्या कुचक्रात अडकताे. ही तर अतिशय सामान्य गाेष्ट आहे की जेव्हा कमवणारे कमी आणि खाणारे जास्त राहतील तेव्हा शारीरिक गरजेनुसार अन्न वस्त्र इत्यादी मिळणार नाही. भारतातील आज अनेक गावांमध्ये ही समस्या निर्माण झाली आहे, ज्यामुळे मूलभूत सुविधंपासून वंचित राहिल्याने लाेकांच्या राहणीमानात घट येते. लाेकसंख्या वाढीच्या कारणांमध्ये सांगितल्याप्रमाणे देशातील गरीब आई वडील आर्थिक सहाय्य मिळावे म्हणून जास्त मुले जन्माला घालतात. परंतु मुलांना शिक्षित करण्याएवढी चांगली परिस्थिती नसल्याने ही मुले शिक्षण साेडून लहानपणापासून मजुरी करतात. व या चक्रात अडकून त्यांच्या येणाऱ्‍या पिढ्याही गरीबच जन्मतात. ज्या देशातील लाेक फक्त आपल्या पाेटाच्या भरण पाेषणात लागलेले राहतील, त्या देशाची विज्ञान आणि उद्याेग क्षेत्रातील प्रगती हाेणे शक्य नाही. अश्‍या देशात विकासाची कल्पना करणेही कठीण आहे. आज दक्षिण आफ्रिकेतील अनेक द्वीप समूहांवर ही परिस्थिती उभी आहे. आज ज्या पद्धतीने देशातील लाेकसंख्येत वृद्धी हाेत आहे, जर हे चक्र असेच सुरू राहिले तर येत्या काही वर्षातच आपल्यासमाेर बेराेजगार, भुकेलेले, निराश लाेकांची एक फाैजच उभी राहील. आणि ही फाैज देशाची सामाजिक, आर्थिक व राजकीय प्रणालीला मुळांपासून हलवून देईल. म्हणून आज आवश्‍यकता आहे की शासनाने देशच्या वाढत्या लाेकसंख्या समस्येकडे लक्ष देऊन वेळीच उपाय याेजना करायला हव्यात. वाढत्या लाेकसंख्येमागील आणखी एक कारण देशातील गरिबी हाेय. अनेक गरीब आई वडील फक्त एवढ्यासाठी मुले जन्माला घालतात कारण त्यांना आर्थिक मदत हवी असते. या मुलांरना कमी वयात बाल मजुरी व इतर श्रमाच्या काकमांवर लावून दिले जाते. देशातील काही धार्मिक रूढीवादी लाेक कुटुंबनियाेजनाचे नियक अवलंबण्यास विराेध करतात. ज्यामूळे त्यांची लाेकसंख्या वाढते.",
  "एका सभ्य आणि सुशिक्षित समाजाचे निर्माण त्या देशातील शिक्षित नागरिकांमुळे हाेते. असे मानले जाते की एका पुरुषाला शिक्षित केल्याने एकच व्यक्ती शिक्षित हाेताे आणि एका स्त्री ला शिक्षित केल्याने संपूर्ण कुटुंब शिक्षित हाेते. स्त्री कुटुंबाचा केंद्रबिंदू असते. ती आईच्या रूपात आपल्या मुलांना संस्कार देते. देशातच्या सामाजिक आणि आर्थिक प्रगतीसाठी पुरुषांसाेबत स्त्रियांनाही शिक्षित करणे महत्वाचे आहे. भारतात आज विशेष करून शहरी भागात स्त्रिया पुरुषांच्या बराेबरीने काम करीत आहेत. आज प्रत्येक क्षेत्रात स्त्रिया कार्यरत आहेत. परंतु आजही जर आपण भारताची तुलना इरत विकसित देशांशी केली तर आपल्या लक्षात येईल की महिलांना शिक्षित करण्यात आपण किती मागे आहाेत. शिक्षण आयुष्यात खूप महत्त्वाचे आहे. शिक्षणाने बुध्दीचा विकास हाेताे आणि साेबतच ज्ञान देखील वाढते. खरे पाहता शिक्षण हेच मुर्खाला विद्वान बनवते. मागील काही दशकात देशात जी काही महिलांची स्थती सुधारली आहे ती फक्त आणि फक्त स्त्री शिक्षणामुळे शक्य झाली आहे. भारताला विकसनशील देश बनवण्यासाठी हे अत्यंत आवश्‍यक आहे. मागील काही वर्षाआधी महिलांच्या तुलनेत पुरुषांच्या साक्षरतेची संख्या अधिक हाेती. भारताच्या स्वातंत्र्यानंतर जेव्हा देशप्रजासत्ताक राष्ट्र बनले तेव्हा पासून शासनाने महिला शिक्षणाकडे विशेष लक्ष द्यायला सुरुवात केली. जरी आज प्रत्येक गावागवात शिक्षण पाेहचले आहे, तरी ही देशातील काही ठिकाण असेही आहते जेथे स्त्रियांना शिकवणे व्यर्थ मानले जाते. त्यांना फक्त चूल आणि मुल सांभाळण्याचे प्रशिक्षण दिले जात अशिक्षित महिलेपेक्षा एक शिक्षित महिला जास्त सक्रिय पद्धतीने कुटुंबाला सांभाळते. शिक्षित महिला तिच्या कुटुंबातील प्रत्येक सदस्याला जबादार बनवते. ती तिच्या मुलांमध्ये चांगल्या गुणांचा संचार करते. अशा पद्धतीने एक शिक्षित महिला संपूर्ण कुटुंब आणि समाजाला शिक्षित करते. म्हणून स्त्री शिक्षणाकडे अधिकाधिक लक्ष द्यायला हवे. स्त्री शिक्षणाचे अनेक फायदे आहेत. शिक्षण प्राप्त करून स्त्री मध्ये आत्मविश्‍वास आणि आत्मसन्मान निर्माण हाेताे. याशिवाय महिलांना शिक्षित केल्यावर कुटुंबाला त्यांचे फायदे हाेतात. शिक्षित महिला नाेकरी करून आपल्या कुटुंबाला आर्थिक मदत करू शकते. शिकलेले स्त्री आपल्या मुलांना कधीही अशिक्षित राहू देणार नाही. लहानपणापासूनच ती आपल्या बाळामध्ये सदगुणांचा संचार करील. आज भारत हा स्त्री शिक्षणात नित्य प्रगती करीत आहे.",
  "भारताला कृषी प्रधान देश म्हटले जाते. भारतीय अर्थव्यवस्थेचा कणा शेती हाच आहे. शेतात काम करणाऱ्‍या व्यक्तीला शेतकरी म्हटले जाते. शेतकरी हा संपूर्ण दिवस शेतात काम करताे, ऊन, वारा, पाऊस इत्यादींची पर्वा न करता आपले कार्य करीत असताे. शेतकरी कठीण परिश्रमाचे प्रतीक आहे. त्याच्यात फार संयम असताे. वर्षभर शेतात काम करून ताे आपल्या कष्टाच्या फळाची वाट पाहत बसताे. शेतकरी आपले जीवन सन्मानाने जगताे. आपले संपूर्ण आयुष्य निसर्गाच्या सानिध्यात घालवताे. शेतकऱ्‍याचे जीवन संतुलिक असते. ताे दरराेज सकाळी लवकर उठताे. दिसभरात त्याला अनेक कामे करायची असतात. सकाळी लवकर उठून तयारी वैगरे करून ताे शेताकउे निघताे. ताे आपला संपूर्ण दिवस शेतातील पिकांची काळजी मध्ये घालवताे. शेत नांगरणे, पीक पेरणे, पिकाला पणी देणे, ऊन वाऱ्‍यापासून आपल्या पिकाचे रक्षण करणे इत्यादी अनेक कामे शेतकऱ्‍याला करावी लागतात. शेतकरी त्याचे पीक अनेक नैसर्गिक आपल्या पासून संरक्षित करताे. पशु, पक्षी, किउे, मुंग्या इत्यादींपासून ताे आपल्या पिकाचे रक्षण करताे. शेतात सुंदर बहरलेल्या पिकामागे शेतकऱ्‍याची शेताविषयीची भक्ती, प्रेम आणि कठीण परिश्रम असते. एक शेतकरी संपूर्ण जगातील मानवाला अन्न पुरविण्यासाठी आपलया जीवन व्यतीत करताे. दिवसभर शेतात काम केल्यावर संध्याकाळी सूर्य मावळल्यांनतर शेतकरी आपल्या घरी पाेहाेचताे. ज्यावेळी ताे घरी पाेचताे तेव्हा ताे अत्यंत थकलेला असताे पण तरीही त्याच्या चेहऱ्‍यावर आनंद दिसत असताे. हा आनंदच त्याच्या कष्टाचे फळ असते. काेणत्याही देशाच्या यशासाठी शेतकऱ्‍यांचे याेगदान फार महत्त्वाचे आह. शेतकरी आपलया प्रयत्नांनी देशाची अर्थव्यवस्था मजबूक करू शकताे. आणि म्हणूनच शेती व शेतकऱ्‍याला अर्थव्यवस्थेचा कणा म्हटले जाते. देशातील शासनाची ही जबाबदारी आहे की त्यांनी शेतकऱ्‍याची याेग्य साेय करायला हवी, जेणेकरून ते काेणत्याही अडथळ्याशिवाय आपले कार्य करू शकतील. शेतकऱ्‍यांना आधुनिक तंत्रज्ञान उपयाेगात आणण्यासाठी शासनाने प्राेत्साहित करायला हवे. आधुनकि पद्धतीने केलेली शेती त्यांना कमी कष्टात जास्तीतचे उत्पन्न मिळवून देऊ शकते. शेतकऱ्‍याचे जीवन आपल्याला अनेक शिकवण देऊन जाते. त्यांचे कठीण परिश्रम आणि संयम आपण सर्वांसाठी एक उदाहरण आहे. आणि म्हणूनच आपण सर्वांची जबाबदारी आहे की आपण शेतकऱ्‍यांना शक्य हाेईल तशी मदत करायला हवी. जर काही कारणास्तव शेतकऱ्‍याचे पीक नष्ट झाले असेल तर त्याला आर्थिक सहाय्य करायला हवे.",
  "मित्रांनाे आजच्या या लेखात आपण खेळांचे महत्व पाहणार आहाेत. जगात काेणताही व्यक्ति असाे त्याने कधी न कधी काेणता न काेणता खेळलेलाच असाते. खेळाचे अनेक फायदे आहेत आणि या लेखाद्वारे मी तुम्हाला तेच फायदे सांगणार आहे. मनुष्याला राेगांपासून दूर राहण्यासाठी निराेगी शरीर असणे आवश्‍यक आहे. एका निराेगी शरीरातून निराेगी मन व बुध्दीचा विकास हाेताे. शरीराला स्वस्थ ठेवण्यासाठी खेळांचे भरपूर महत्त्व आहे. खेळांमुळे शरीर व मन दाेघेही निराेगी राहतात. खेळ खेळल्याने मनुष्यात धैर्य, सहनशीलता आणि मानवी गुणांचा विकास हाेताे. खेळ आजच्या व्यस्त जीवनात महत्त्वाची भूमिका बजावते. खास करून विद्यार्थ्यांच्या जीवनात खेळांचे महत्त्व भरपूर आहे. म्हणून प्रत्येक विद्यार्थ्याला दिवसातून थाेडा वेळ काढून खेळायला हवे. खेळ खेळल्याने तंदुरुस्ती साेबत मनाेरंजनही हाेते. काेणताही खेळ खेळल्याने व्यक्तीचा शारीरिक विकासासाेबत मानसिक विकासही हाेताे. खेळताना डाेळे, मेंदू व शरीराच्या प्रत्येक अवयवाचा वापर करावा लागताे. खेळांमुळे शरीराचे संतुलनही वाढते. नियमि काेणतातरी खेळ खेळल्याने चित्त प्रसन्न राहते. शरीरिक अवयवांचा व्यवस्थित विकास हाेताे. मनाल उल्हास आणि उत्साह वाढून आयुष्यातील प्रत्येक क्षेत्रात यशे मिळते. खेळांचे देखील वेगवेगळे प्रकार असतात काही खेळ शारीरिक तर काही मानसिक असतात. शारीरिक खेळ खेळण्यासाठी शरीराल श्रम करावे लागते, तर मानसिक खेळांमध्ये मेंदूचे कार्य असते. फुटबाॅल, हाॅकी, व्हाॅलीबाॅल, कि्रकेट, टेनिस, कबड्डी इत्यादी शारीरिक खेळ आहेत. या खेळांना खेळण्यासठी मानसिक शारीरिक ताकत लागते. दुसरीकडे बुद्धीबळ, पत्ते, चाैपट इत्यादी मानसिक खेळ आहेत, ज्यांना खेळण्यासाठी मानसिक शक्तीचा वापर करावा लागताे. या शिवाय इनडाेर आणि आऊटडाेर खेळांचे प्रकार आहेत. आजकाल इनडाेर खेळांमध्ये काॅम्प्यूटर व माेबाईल गेम्स माेठ्या प्रमाणत खेळले जात आहेत. परंतु हे खेळ तुमचे स्वस्थ सुधारणा ऐवजी बिघडवित आहेत. बाहेर खेळाला जाणार खेळ काेणताही असाे ताे आपल्या शरीराला स्वस्थ आणि मनाला प्रसन्न करताे. खेळ मनुष्याचा व्यक्तिमत्त्व विकास करतात. ते एकमेकांमध्ये सहकार्य व बंधूता वाढवतात. खेळांमुळे परंपरा सन्मान आणि प्रेम देखील वाढते. अश्‍या पद्धतीने खेळ आपलयाला गुणवान, चारित्र्यवान आणि एक खरा व्यक्ती बनवतात."
];

const sentencesArrayEnglish = [
  "Walking is the safest and most convenient activity for weight control, ailment free, healthy, and all- round physical fitness. But walking also gives one a lot of pleasure and satisfaction. Walking is about success, growth, determination, and deduction.Did you know that walking uses large portions of muscle groups in your legs and arms in a steady. rhythmic pattern? No wonder it is recommended not just fitness but for total health too. It is the cornerstone of a total approach to personal fitness. Walking is one exercise that offers multiple advantages at a minimum cost and with the least effort.Walking increases the flow of oxygen to all tissues and cells. It increases the high-density lipoproteins which protect the heart and blood vessels from fatty deposits. It protects and strengthens the heart muscles whereby it can pump more blood with fewer beats..Walking increases the ability of the body to handle stress successfully, making you less prone to blood pressure and heart disease. It decreases the sugar fats, known as triglycerides, thus preventing them are being deposited on the lining of the arteries.",

  "The great advantage of early rising is the good start it gives us in our day's work. The early riser has done a large amount of hard work before other men have got out of bed. In the early morning the mind is fresh, and there are few sounds or other distractions, so that work done at that time is generally well done. In many cases the early riser also finds time to take some exercise in the fresh morning air, and this exercise supplies him a fund of energy that will lost until the evening. By beginning so early, he knows that he has plenty of time to do thoroughly all the work he can be expected to do, and is not tempted to hurry over any part of it. All his work being finished in good time, he has a long interval of rest in the evening before the timely hour when he goes to bed. He gets to sleep several hours before midnight, at the time when sleep is most refreshing and after a sound night's rest, rises early next morning in good health and spirits for the labors of a new day. It is very plain that such a life as this is far more conducive to health than that of the man who shortens his waking hours by rising late, and so can afford in the course of the day little leisure for necessary rest. Any one who lies in bed late, must, if he wishes to do a full day's work, go on working to a correspondingly late hour, and deny himself the hour or two of evening exercise that he ought to take for the benefit of his health. But in spite of all his efforts, he will probably produce as good results as the early riser, because he misses the best working hours of the day. It may be objected to this that some find the perfect quiet of midnight by far the best time for working. This is no doubt true in certain cases. Several great thinkers have found by experience that their intellect is clearest, and they can write best, when they burn the midnight oil. But even in such cases the practice of working late at night cannot be commended. Few men, if any, can exert the full power of their intellect at the time when nature prescribes sleep, without ruining their health thereby. ",

  "A difference in opinions, values, attitudes and lifestyle among people of different ages is called 'generation gap'. Due to these differences, people belonging to different generations find themselves unable to relate to each other. This communication gap between successive generations is not a new phenomenon. The fight between the old and the young is not new and has been bound in the culture of every nation of the world. Parents and children across the world have been facing this problem. Due to fast-paced modern lifestyles, parents and children hardly find time together. The children, thus unable to express their thoughts and ideas to their parents, turn to friends for advice who are as inexperienced as they are. In the era of globalization and liberalization, the gap between the young the old reached its zenith.Today's children are born into a competitive world and have a struggle to get every thing. Many a time their true potential gets overshadowed in the rat race. Parents- burdened by the expectations of the society- end up forcing certain subjects and careers and lives that their parents have chosen for them, children are left lost and confused. Parents, on the other hand, feel that in this rapidly changing society where everyone is so self-centered, it is their duty to protect their children. Parents tend to feel that their children require guidance. This cannot be denied. But their constant monitoring makes children feel oppressed and they tend to turn rebellious. Thus, generation gap is destroying the basic human relationship and is obviously a threat to the social stability of family relations. It is essential for parents to talk to their children and treat them as individuals. To be forever treated as child can be irritating and sometimes even humiliating. Children, in turn, must reciprocate with due respect and attention. Matters such as career, lifestyle and sensitive issues like freedom of choice of friends must be dealt with carefully and with maturity. Love and understanding are the best antidotes to this ever-widening generation gap. Only then will children look up to their parents and parents will not be burdened with their guilt of not being there for their children in their hour of need. In this way generation gap can at least be narrowed, if not completely filled.",

  "Travelling is an important part of human life. It gives you a break form your busy life and makes you feel renewed for a new start. It takes away all you stress and improves your health and mind. We can explore the serene nature around us and meet new people. This makes us feel livelier. For so long I wanted to take my parents out for a trip. Since last time I planned to visit Goa to take a break and refresh myself. It was such a thrilling trip. I enjoyed all three days spent in Goa. The overall trip was very good. I had so much fun with my family. The sun and the sky were clear. I expected rain but there was no sign of it. I prefer to travel in the summer season. Rains can drench area pretty quickly. It also ruins your plans and spoils the whole trip. I have seen many tourists in Goa. People come from so far to spend some good time here. It is nice to meet new people. I really like Goa for many reasons. I like beaches. It was my dream place as I have heard many things about this place. So, I fulfilled my dream and reached Goa to enjoy my life and get away from the daily hustles. It is no new news that travel is good for your body but there are many researchers which suggest that exploring a new place can do wonders for your mental and emotional health as well. A trip enhances your mood. It gives you a reason to smile. I believe that a person should go on a trip once a month. I am always busy when I travel it is taking photos or just exploring a place on foot. I know I am the calmest and most relaxed when I travel. Also, the lessons you learn along the way make you more aware and open to new things. I Love going to places with different cultures because it forces you to think about your own. When you explore new places, you give yourself a chance of fresh start. It makes you feel calm. When you are going through a tough time in your life it gives you more clarity. I think people in general are not meant to be tied down to just one place their entire lives.",
];

// ALL ELEMENTS TO BE USED
const result = document.getElementById("result");
const UserInput = document.getElementById("UserInput");
const backspaceSpan = document.getElementById("backspace");
const keyStrokeSpan = document.getElementById("keystroke");
const contentLengthSpan = document.getElementById("contLength");
const mistakesSpan = document.getElementById("mistakes");
const typedWordCountSpan = document.getElementById("typedWordCount");
const pendingWordSpan = document.getElementById("pendingWordCount");
const accuracySpan = document.getElementById("accuracyCount");
let correct_word = 0;
let accuracyCount = 0;
let typedWordCount = 0;
let remainingWords = 0;
let total_words = 0;
let secondsRemaining;
let intervalId;
let type_language = "";
let EnglishTextReal = "";
let back_space_count = 0;
let mistakeCount = 0;
let lastValue = "";

// userdefined function started
let innerLoopIndex = 0;
let location_string = "";
let key_stroke_count = 0;
let timerInterval = null;
let totalSeconds = 0; // Use this for count-up
let startTime; // Use this for countdown
let spaceIndices = [];
const totalTimeInSeconds = 600; // 10 minutes for countdown

function getc(lang) {
  console.log(lang);
  selectedlang= lang;
  renderNewQuote(lang);
}

function startTimer() {
  // if (test_type === "speed") {
  // Speed Test: Countdown timer
  if (!timerInterval) {
    let timeRemaining = totalTimeInSeconds;
    timerInterval = setInterval(() => {
      timeRemaining--;
      document.getElementById("countdown").textContent =
        formatTime(timeRemaining);
      if (timeRemaining <= 0) {
        stopTimer();
        alert("Time's up!");
      }
    }, 1000);
  }
}
//     } else {
//       // Practice Test: Count-up timer
//       if (!timerInterval) {
//         totalSeconds = 0; // Reset counter for count-up
//         timerInterval = setInterval(() => {
//           totalSeconds++;
//           document.getElementById("countdown").textContent =
//             formatTime(totalSeconds);
//         }, 1000);
//       }
//     }
//   }

function stopTimer() {
  clearInterval(timerInterval);
  timerInterval = null;
}

function formatTime(seconds) {
  const hours = Math.floor(seconds / 3600);
  const minutes = Math.floor((seconds % 3600) / 60);
  const secondsRemain = seconds % 60;

  return [hours, minutes, secondsRemain]
    .map((val) => (val < 10 ? "0" + val : val))
    .join(":");
}

// main code FOR ENGLISH start here
UserInput.addEventListener("input", function (event) {
  startTimer();
  // console.log((UserInput.value).length);
  // to count keystorke

  if (event.inputType !== "deleteContentBackward") {
    // Increment keystroke count for every input event
    key_stroke_count += 1;
    keyStrokeSpan.textContent = key_stroke_count;
  }

  // For Engkish language
  // if (type_language === "english")
  if (selectedlang === "English") {
    // Get the current user value
    const currentValue = UserInput.value;

    // Check if a space was added or removed
    if (lastValue && currentValue.length > lastValue.length) {
      if (currentValue[currentValue.length - 1] === " ") {
        typedWordCount += 1;
      }
    } else if (lastValue && currentValue.length < lastValue.length) {
      if (lastValue[lastValue.length - 1] === " ") {
        if (typedWordCount > 0) {
          typedWordCount -= 1;
        } else {
          typedWordCount = 0;
        }
      }
    }

    // to count ramining word
    remainingWords = total_words - typedWordCount;
    // console.log("hogj",remainingWords)
    pendingWordSpan.innerText = remainingWords;

    // Update last value for the next input event
    lastValue = currentValue;

    // Update the word count display
    typedWordCountSpan.textContent = typedWordCount;

    return;
  }

  //******/ For Marathi Language***************
  else {
    const text = UserInput.value;

    if (event.inputType == "deleteContentBackward") {
      // To count backspace
      back_space_count = back_space_count + 1;
      backspaceSpan.textContent = back_space_count;
      // key_stroke_count--;
      key_stroke_count = Math.max(0, key_stroke_count - 2);
      keyStrokeSpan.textContent = key_stroke_count;
      console.log(key_stroke_count);

      const lastCharacterIndex = EnglishTextReal.length - 1;

      // While deleting if space is removed
      if (EnglishTextReal.charAt(lastCharacterIndex) === " ") {
        spaceIndices.pop();
      }
      EnglishTextReal = EnglishTextReal.slice(0, lastCharacterIndex);
    } else {
      EnglishTextReal += text.substring(text.length - 1);
    }

    const lastIndexOfSpaceInMarathi =
      spaceIndices[spaceIndices.length - 1] || 0;

    const previousMarathiValue = text.slice(0, lastIndexOfSpaceInMarathi) || "";
    const englishWordToBeTranslated = EnglishTextReal.slice(
      lastIndexOfSpaceInMarathi
    );

    // ṆEW function updated
    const translatedMarathiWord = convertToMarathiUpdated(englishWordToBeTranslated);
    const finalUpdatedValue = `${previousMarathiValue}${translatedMarathiWord}`;

    if (EnglishTextReal.length - 1 > lastIndexOfSpaceInMarathi) {
      typedWordCount = spaceIndices.length + 1;
    } else if (spaceIndices.length) {
      typedWordCount = spaceIndices.length;
    } else if (finalUpdatedValue.length) {
      typedWordCount = 1;
    } else {
      typedWordCount = 0;
    }

    UserInput.value = finalUpdatedValue;

    // Update the word count display
    typedWordCountSpan.textContent = typedWordCount;

    // to count ramining word
    remainingWords = total_words - typedWordCount;
    // console.log("hogj",remainingWords)
    pendingWordSpan.innerText = remainingWords;
  }
});

// TO disabale more than one space
UserInput.addEventListener("keydown", function (event) {
  if (event.key === " " && UserInput.value.slice(-1) === " ") {
    event.preventDefault();
  } else if (event.key === " ") {
    spaceIndices.push(UserInput.value.length);
  }

  // Decrement keystroke count for backspace key
  if (event.code === "Backspace") {
    key_stroke_count -= 1;
    // Increment back space only if there is previous value present
    if (lastValue) {
      back_space_count += 1;
    }

    // Ensure keystroke count is never negative
    if (key_stroke_count < 0) {
      key_stroke_count = 0;
    }

    // Update the keystroke count display
    keyStrokeSpan.textContent = key_stroke_count;
    backspaceSpan.textContent = back_space_count;
  }
});

function compareEnglishPassages() {
  stopTimer();
  document.getElementById("UserInput").disabled = true;
  const inutValue = UserInput.value;
  const expectedValue = textToType;
  const wordsCorrectlyTyped = getLongestContinuousSequence(
    expectedValue,
    inutValue
  );

  const spansStartingWithW = document.querySelectorAll('[id^="w"]');
  // Change the text color to red for all selected spans
  spansStartingWithW.forEach((span) => {
    span.style.color = "red";
  });

  // Complete input is wrong then set accuracy rate to 0
  if (!wordsCorrectlyTyped.length) {
    mistakesSpan.textContent = expectedWords.length;
    accuracySpan.innerText = "0%";
  }

  const correctWords = getCorrectWordsHighlighted(
    wordsCorrectlyTyped,
    expectedWords
  );

  // to count error
  const mistakeCount = expectedWords.length - correctWords;
  mistakesSpan.textContent = mistakeCount;

  accuracyCount = (correctWords * 100) / typedWordCount;
  accuracyCount = accuracyCount.toFixed(1);
  accuracySpan.innerText = `${accuracyCount}%`;

  return;
}

// FUNCTION TO RENDER NEW QUOTE to display
const renderNewQuote = (type_language) => {
  UserInput.value = ""; //to clear textarea
  if (selectedlang === "Marathi") {
    const randomIndex = Math.floor(
      Math.random() * sentencesArrayMarathi.length
    );
    textToType = sentencesArrayMarathi[randomIndex];
  } else if (type_language === "hindi") {
    const randomIndex = Math.floor(Math.random() * sentencesArrayHindi.length);
    textToType = sentencesArrayHindi[randomIndex];
  } else {
    const randomIndex = Math.floor(
      Math.random() * sentencesArrayEnglish.length
    );
    textToType = sentencesArrayEnglish[randomIndex];
    UserInput.disabled = false;
  }
  // console.log(textToType);
  const seperator_word = textToType.split(/\s+/);

  //MAKE THE SELECTED PARA INTO ARRAY OF WORDS
  expectedWords = textToType.split(" ");

  // To count the length of para
  const lengthCount = expectedWords.length;

  // to count all words
  contentLengthSpan.textContent = lengthCount;
  total_words = lengthCount;

  console.log("psaas", seperator_word);

  // Iterate through the words and create <span> elements
  let span_id = 0;
  for (const word of seperator_word) {
    const spanElement = document.createElement("span");
    spanElement.textContent = word + " "; // Add a space after each word
    spanElement.id = "w" + span_id;
    result.appendChild(spanElement);
    span_id++;
  }
  // result.innerHTML = textToType;
};
