const sentencesArrayMarathi = [
  "वाढत्या लाेकसंख्येचा सरळ परिणाम देशातील लाेकांच्या जीवनावर पडताे. स्वातंत्र्या नंतर आपल्या देशात कृषी व उद्याेग क्षेत्रात अभूतपूर्व प्रगती झाली. परंतु या आर्थिक प्रगती नंतरही देशातील प्रतिव्यक्ती उत्पन्न वाढले नाही. वाढत्या लाेकसंख्येने देशाच्या प्रगतीला राेखले आहे. जर एखाद्या देशाची लाेकसंख्या माेठ्या प्रमाणात वाढत असेल तर त्या देशात असलेल्या पायाभूत सुविधा आणि संसाधनांवर दबाव पडताे. वीज, पेट्राेल, डिझेल, परिवहन, अन्न, पाणी, घरे इत्यादी गाेष्टींची मागणी वाढल्यावर त्या गाेष्टींचा तुटवडा निर्माण व्हायला लागताे. परिणामी महागाई वाढून देश गरिबीच्या कुचक्रात अडकताे. ही तर अतिशय सामान्य गाेष्ट आहे की जेव्हा कमवणारे कमी आणि खाणारे जास्त राहतील तेव्हा शारीरिक गरजेनुसार अन्न वस्त्र इत्यादी मिळणार नाही. भारतातील आज अनेक गावांमध्ये ही समस्या निर्माण झाली आहे, ज्यामुळे मूलभूत सुविधंपासून वंचित राहिल्याने लाेकांच्या राहणीमानात घट येते. लाेकसंख्या वाढीच्या कारणांमध्ये सांगितल्याप्रमाणे देशातील गरीब आई वडील आर्थिक सहाय्य मिळावे म्हणून जास्त मुले जन्माला घालतात. परंतु मुलांना शिक्षित करण्याएवढी चांगली परिस्थिती नसल्याने ही मुले शिक्षण साेडून लहानपणापासून मजुरी करतात. व या चक्रात अडकून त्यांच्या येणाऱ्‍या पिढ्याही गरीबच जन्मतात. ज्या देशातील लाेक फक्त आपल्या पाेटाच्या भरण पाेषणात लागलेले राहतील, त्या देशाची विज्ञान आणि उद्याेग क्षेत्रातील प्रगती हाेणे शक्य नाही. अश्‍या देशात विकासाची कल्पना करणेही कठीण आहे. आज दक्षिण आफ्रिकेतील अनेक द्वीप समूहांवर ही परिस्थिती उभी आहे. आज ज्या पद्धतीने देशातील लाेकसंख्येत वृद्धी हाेत आहे, जर हे चक्र असेच सुरू राहिले तर येत्या काही वर्षातच आपल्यासमाेर बेराेजगार, भुकेलेले, निराश लाेकांची एक फाैजच उभी राहील. आणि ही फाैज देशाची सामाजिक, आर्थिक व राजकीय प्रणालीला मुळांपासून हलवून देईल. म्हणून आज आवश्‍यकता आहे की शासनाने देशच्या वाढत्या लाेकसंख्या समस्येकडे लक्ष देऊन वेळीच उपाय याेजना करायला हव्यात. वाढत्या लाेकसंख्येमागील आणखी एक कारण देशातील गरिबी हाेय. अनेक गरीब आई वडील फक्त एवढ्यासाठी मुले जन्माला घालतात कारण त्यांना आर्थिक मदत हवी असते. या मुलांरना कमी वयात बाल मजुरी व इतर श्रमाच्या काकमांवर लावून दिले जाते. देशातील काही धार्मिक रूढीवादी लाेक कुटुंबनियाेजनाचे नियक अवलंबण्यास विराेध करतात. ज्यामूळे त्यांची लाेकसंख्या वाढते.",

  "आजच्या आधूनिक युगात शिक्षणाचे महत्त्व भरपूर आहे. असे म्हटले जाते की. “जे युद्ध तलवारीने जिंकले जात नाही ते पेनाच्या श्‍क्तीने जिंकू शकताे“. आणि ही गाेष्ट अतिशय सत्य देखील आहे. कारण पेन पकडता येणे हेच मूळात साक्षरतेचे प्रमाण आहे. साक्षरतेचा अर्थ देशातील अशिक्षित लाेकांना शिक्षित करून वाचन व लेखन करण्यायाेग्य बनवणे हाेय. दुसऱ्‍या शब्दात सांगायचे झाले तर साक्षर असणे म्हणजे वाचन व लेखन करण्याची याेग्यता प्राप्त करणे हाेय. भारतात राष्ट्रीय साक्षरता मिशन अनुसार जर एखादा व्यक्ती आपले नाव लिहिणे व वाचण्या याेग्य असेल तर ताे साक्षर आहे. वर्तमान काळात शिक्षणचे महत्त्व भरपूर आहे. शिक्षण ही जीवनातील एक आवश्‍यक बाब आहे. याशिवाय अशिक्षित लाेकही आपल्याच समाजाच भाग आहेत. आणि त्यांना साक्षर करणे आपले कर्तव्य आहे. कारण जर एखद्या देशाचा प्रत्येक नागरिक साक्षर असेल तरच त्या देशाची प्रगती हाेईल. साक्षरतेचा संबंध देशाच्या सामाजिक व आर्थिक विकासाशी आहे. शिक्षणाशिवाय व्यक्तीचे जीवन पशूप्रमाणे हाेते. भारताला गावांचा देश म्हटले जाते. कारण आपल्या दशातील बहुसंख्य लाेक खेड्या गावात राहतात. या लाेकांमध्ये शेतकरी मजूर इत्यादींची संख्या अधिक आहे आणि सर्वात जास्त अशिक्षित व निरक्षर हेच लाेक आहेत. अश्‍या काळात अशिक्षिततेचा फायदा घेऊन अनेक चतुर व्यापरी, कुटील नेते आणि सरकारी अधिकारी यांचा आपल्या कार्यासाठी लाभ करून घेतात. निरक्षर लाेक शासनाकडून आलेल्या येजना व्यवस्थित समजू शकत नाही व यामुळे त्यांना सरकारी याेजनांचा लाभ मिळत नाही, साक्षर लाेक शासनाच्या याेग्य निर्णयांमध्ये सहयाेग करतात आणि चुकीच्या निर्णयांचा विरांध देखील करतात. साक्षर व्यक्तीला आपलया मताची किंमत माहिती असते. म्हणून ताे याेग्य नेत्यालाच आपले मत देताे. आपला देश कृषिप्रधान देश आहे. जर या देशातील शेतकरी साक्षर असेल तरच ताे शेतीमधून अधिक उत्पन्न प्राप्त करू शकताे. शिकेले शेतकरी वैज्ञानिक पद्धतीने शेती करतात. ते नवनवीन आधुनिक उपकरणांचा उपयाेग करून शेतातून अधिक धान्य उत्पन्न करातात. आणि आपल्या गावाचा व देशाचा विकास करतात. ज्याप्रमाणे पुरुषांसाठी शिक्षणाचे महत्त्व आहे त्याच पद्धतीने स्त्री शिक्षण देखील अत्यावश्‍यक आहे. एक शिक्षित महिला आपली मुले व कुटुंबातील इतर सदस्यांना शिक्षित करते. यासाेबतच नाेकरी व व्यवसाय करून कुटुंबाला आर्थिक सहयाेग पाेहचवते.",

  "आज मानव प्रगतीमुळे पर्यावरण प्रदूषित हाेत आहे. प्राचीन काळात ऋषी मुनी आश्रमा बाहेर अनेक झाडे लावत असत. यामुळेच त्यांचे आयुष्य निराेगी व अनेक वर्षे राहत असे. आपल्या चारही बाजूंना असलेल्या सुंदर निसर्गात परमेश्‍वराने एकाहून एक अद्भूत गाेष्टी बनवल्या आहेत. सुंदर फुले, हिरवी झाडे, वेगवेगळे रंग आणि रूप असलेले पशुपक्षी इत्यादी गाेष्टी आपले मन माेहून घेतात. मानवी जीवनात झाडांचे महत्व विशेष आहे. झाडे मनुष्यासाठी अत्यंत उपयुक्त आहेत, मी मनुष्य जीवनाची आधार आहेत. याशिवाय पर्यावरणाचे संतुलन राखण्यासठी वृक्षांचे महत्त्व भरपूर आहे. परंतु आज मानवाने आपल्या वननवीन शाेधांच्या अभिलाषेमुळे पर्यावरणाला नुकसान पाेहचवणे सुरू केले आहे. अश्‍या काळात पर्यावर संवर्धन ही काळाची गरज झाली आहे. पृथ्वीवरील अनेक प्राणी आपल्या अन्नासाठी वृक्षांवर अवलंबून आहेत. मनुष्य हवेत असलेला ऑक्सिजन हा प्राणवायू श्‍वासाद्वारे ग्रहण करताे. अशा पद्धतीने वृक्ष मनुष्यासाठी अत्यंत उपयुक्त आहेत. मागील काही वर्षांमध्ये देशतील कारखान्यांची संख्या वाढली आहे. या कारखान्यात लागणारा कच्चामाल तसेच देशातील वाढती लाेकसंख्या अश्‍या अनेक गाेष्टी वृक्षताेडीसाठी कारणीभूत आहेत. देशात हाेत असलेला पर्यावरणाचा ऱ्‍हास वेळीच राेखण्यात आला नाही तर येत्या काळात ही खूश्‍प माेठी समस्या बनून जाईल. पर्यावरण संवर्धनाचे महत्त्व समजून जगभरातील देश वृक्षालागवउ व जास्तीतजास्त सीएनजी गॅस चा उपयाेग करू लागले आहेत. पर्यावरण आपले भविष्य आहे म्हणून याच्या संरक्षणासाठी आपल्याला वेळीच लक्ष द्यावे लागेल. पर्यावरणला प्रदूषण मुक्त करण्यासाइी सर्वात आधीजल प्रदूषणाला राेखावे लागेल. कारखान्यांच खराब पाणी, घरातील दूषित पाणी, नाल्यामधून वाहणारा मल इत्यादी समुद्रात जाण्यापासून राेखले गेले पाहिजे. कारखान्यातून निघणारे विषयुक्त पाणी पिऊन जलचर व उभयचर प्राण्यांची मृत्यू हाेत. दुसरी कडे त्याच प्रदूषित पाण्याला शेतात वापरले जाते. व दूषित पाण्यात उगवलेला भजीपाला खाऊन आपले आराेग्य बिघडण्याचा धाेका असताे. म्हणून सांगण्याचे तात्पर्य एवढेच आहे की जर आपल्या उद्याला आराेग्यदायी बनवायचे आहे तर आजपासून प्रयत्न करायला हवे. जर प्रदूषणानंतर वायू प्रदूषणाने पर्यावरणाला खूप हानी पाेहाेचवली आहे. माेठ माेठ्या कारखान्यांच्या चिमण्यांमधून निघणारे धूर, रेल्वे व इतर पेट्राेल, डिझेल वर चालणारी वाहनांमधून निघणारा धूर वायु मंडळात मिसळून वातावरण प्रदूषित करताे. या शिवाय ध्वनी प्रदूषाणाची समस्या ही माेठ्या प्रमाणत आहे .",

  "आपल्या देशात देवाच्या बाल रुपाची अनेक मंदिरे आहेत. जसे बाल गणेश, हनुमान, श्रीकृष्ण इत्यादी. आपल्या देशात मुलांना देवा घरची फुले म्हटले जाते. ध्रुवबाळ, भक्त प्रलहद, लवकुश, अभिमन्यू या सारखे अनेक बालक भारतीय संस्कृतीत हाेऊन गेलेत. परंतु आजच्या काळात भारतात गरिबी ची स्थिती माेठ्या प्रमाणात आहे. देशातील गरीब मुलांची स्थिती चांगली नाही. बालश्रम व बालकामगार आपल्या देशाची माेठी समस्या आहे. बाल मजुरी मुळे गरीब मुलांच भविष्य अंधकामय हाेत आहे. १४ ते १८ वर्षाच्या लहान मुलांद्वारे काम करून घेणे म्हणजेच ‘बाल मजुरी‘ हाेय. कमी वयात काम करण्याऱ्‍या या मुलांना बालकामगार म्हटले जाते. काेणत्याही राष्ट्राच्या विकासासाठी लरुण व लहान मुलांची शक्ती खूप उपयुक्त असते. परंतु आपल्या देशातील काही लाेक थाेड्या पैशांच्या हव्यासापाेटी आपल्या मुलांना बालमजुरी च्या कामला लाऊन देतात. कमी पैशात कामगार मिळाल्याने हाॅटेल, कारखाने व दुकानीचे मालकही या मुलांना कामावर ठेवून घेतात. आज आपलया देशातील गरीब मुले हाॅटेल, कारखाने, दुकानी, धार्मिक स्थळ व इतर ठिाकणी कामे करतांना दिसतात. काही मुले तर माेठ माेठ्या कारखान्यामध्ये धाेकादायक कामगिरी करतानाही दिसून जातात. भारतीय राज्यघटनेच्या १९५० च्या कलम २४ नुसार १४ वर्षाखालील काेणत्याही बालकाला कारखान्यात काम दिले जातणार नाही. व जर काेण्या कारखान्यात या कायद्याचे उल्लंघन हाेताना आढहले तर भारतीय विधिमंडळाने फॅक्टरी ॲक्ट १९४८ आणि चिल्ड्रेन ॲक्ट १९६९ मध्ये तरतुदी करून फॅक्टरी मालकावर दंड व कारावासाची शिक्षा सुनावली आहे. भारतीच राज्यघटनेच्या कलम ४५ नुसार प्रतयेक राज्य शसनाचे कर्तव्य आहे की त्यांनी आपलया राजयातील विद्यार्थ्यांच्या निशुल्क शिक्षणाची व्यवस्था करावी. बालकामगार व बाल मजुरी ही समस्या फक्त भारतात नसून जगातील अनेक विकसनशील देशत माेठ्या प्रमाणात आहे. गरिबी रेषेखलील आई वडील आपल्या मुलांच्या शिक्षणाचा खर्च करू शकत नाहीत. या शिवाय जीवन जगण्यासाठी पैश्‍यांची देखील आवश्‍यक असते. म्हणूनच आपलया मुलांना शाळेत पाठवण्याची बरीच कमी झाली आहे. भारत शासनाचे हे काम प्रशंसनीय आहे. आपल्या देशात आता प्रथमिक व माध्यमिक शिक्षण माेफत करण्यात आले आहे. या शिवाय शाळेतच मुलांना मध्यान भाेजनाची व्यवस्था करण्यात येते.",

  "आजच्या आधुनिक युगात मुनष्य निसर्गाला साधारण आणि तुच्छ समजत आहे. कारण निसर्ग चारही बाजूंना सहज उपलब्ध झाला आहे. आणि जी गाेष्ट व्यक्तीला सहज मिळते त्या गाेष्टीची किंमत व्यक्तीला राहत नाही. परंतु खेरे पाहता निसर्ग मनुष्याचा अतिशय घनिष्ट मित्र आहे व ताे मनुष्यासाठी नेहमी उपयाेगी ठरत असताे. ज्या पद्धतीने एक खरा मित्र नेहमी, प्रत्येक संकटात आपलया साेबत असताे त्याच पद्धतीने निसर्गही आपला साेबती आहे. आजच्या युगात निसर्ग आपल्या जीवनाचा अविभाज्य भाग आहे. अनेक प्रसिद्ध कवी, लेखक, चित्रकार व कलाकार यांनी निसर्गाद्दल अनेक सुंदर रचना केल्या आहेते. आपल्या सभाेवताली असलेले पाणी, हवा जंगल पर्वत नदी, झाडे, भूमी, सूर्य, चंद्र, आकाश, समुद्र इत्यादी गाेष्टींपासून निसर्ग बनताे. निसर्ग अनंत रंगांनी भरलेला आहे ज्याने आपल्या कुशीत सजीव निर्जीव सर्व जीवांना सामावून घेतले आहे. खरे पाहता निसर्ग हा आपला मित्र आहे. कारण निसर्ग हीच ती शक्ती आहे की आपल्याला विश्‍वासत सर्वकाही देते. मग ते आपले अन्न असाे वा जीवन. निसर्गामध्ये ती शक्ती आहे जी शरीरातील सर्व राेगांना दूर करते. वृक्षांची हिरवळ पाहून मानसिक ताणतणाव कमी हाेताे. म्हणून जर कधीही तुम्हाला मासिक तणाव निर्माण झाला असेल तर बागेत जाऊन फिरून या. बागेतील निसर्ग साैदंर्य पाहून मनाला मानसिक शांती लाभेल. निसर्ग आपल्या अन्न, वस्त्र आणि निवारा या मूलभूत गरजांना सहज पूर्ण करताे. निसर्गाने आपल्याला सुंदर हिरवळ दिली आहे. निसर्गाने आपल्याला प्राणवायू दिला आहे. हा प्राणवायू आपल्या जीवनासाठी अत्यंत आवश्‍यक आहे. ऑक्सिजन या प्राणवायू शिवाय आपण फक्त काही क्षण जीवंत राहू शकताे. मनुष्याला कार्य करण्यासाठी ऊर्जेची आवश्‍यकता असते आणि ही ऊर्जा त्याला अन्नातून प्राप्त हाते, व हे अन्न देखील निसर्गच उपलब्ध करून देताे आपल्याला राहण्यासाठी जमीन निसर्गाने दिली आहे या धरतीवर बनवलेले घर सुद्ध निसर्गात उपलब्ध झालेल्या वस्तूं पासून बनवण्यात आले आहे. निसर्ग हा फक्त मनुष्याचाच मित्र नसून ताे पशू व पक्ष्यांचाही घनिष्ट मित्र आहे. कारण ताे मनुष्या साेबत पशू पक्ष्यांची देखील अन्न, बस्त्र आणि निवाऱ्‍याची व्यवस्था करीत असताे. आपल्याला निसर्गाचे संतुलन न बिघडवता याचा याेग्य उपयाेग करवून घ्यायला हवा.",

  "एका सभ्य आणि सुशिक्षित समाजाचे निर्माण त्या देशातील शिक्षित नागरिकांमुळे हाेते. असे मानले जाते की एका पुरुषाला शिक्षित केल्याने एकच व्यक्ती शिक्षित हाेताे आणि एका स्त्री ला शिक्षित केल्याने संपूर्ण कुटुंब शिक्षित हाेते. स्त्री कुटुंबाचा केंद्रबिंदू असते. ती आईच्या रूपात आपल्या मुलांना संस्कार देते. देशातच्या सामाजिक आणि आर्थिक प्रगतीसाठी पुरुषांसाेबत स्त्रियांनाही शिक्षित करणे महत्वाचे आहे. भारतात आज विशेष करून शहरी भागात स्त्रिया पुरुषांच्या बराेबरीने काम करीत आहेत. आज प्रत्येक क्षेत्रात स्त्रिया कार्यरत आहेत. परंतु आजही जर आपण भारताची तुलना इरत विकसित देशांशी केली तर आपल्या लक्षात येईल की महिलांना शिक्षित करण्यात आपण किती मागे आहाेत. शिक्षण आयुष्यात खूप महत्त्वाचे आहे. शिक्षणाने बुध्दीचा विकास हाेताे आणि साेबतच ज्ञान देखील वाढते. खरे पाहता शिक्षण हेच मुर्खाला विद्वान बनवते. मागील काही दशकात देशात जी काही महिलांची स्थती सुधारली आहे ती फक्त आणि फक्त स्त्री शिक्षणामुळे शक्य झाली आहे. भारताला विकसनशील देश बनवण्यासाठी हे अत्यंत आवश्‍यक आहे. मागील काही वर्षाआधी महिलांच्या तुलनेत पुरुषांच्या साक्षरतेची संख्या अधिक हाेती. भारताच्या स्वातंत्र्यानंतर जेव्हा देशप्रजासत्ताक राष्ट्र बनले तेव्हा पासून शासनाने महिला शिक्षणाकडे विशेष लक्ष द्यायला सुरुवात केली. जरी आज प्रत्येक गावागवात शिक्षण पाेहचले आहे, तरी ही देशातील काही ठिकाण असेही आहते जेथे स्त्रियांना शिकवणे व्यर्थ मानले जाते. त्यांना फक्त चूल आणि मुल सांभाळण्याचे प्रशिक्षण दिले जात अशिक्षित महिलेपेक्षा एक शिक्षित महिला जास्त सक्रिय पद्धतीने कुटुंबाला सांभाळते. शिक्षित महिला तिच्या कुटुंबातील प्रत्येक सदस्याला जबादार बनवते. ती तिच्या मुलांमध्ये चांगल्या गुणांचा संचार करते. अशा पद्धतीने एक शिक्षित महिला संपूर्ण कुटुंब आणि समाजाला शिक्षित करते. म्हणून स्त्री शिक्षणाकडे अधिकाधिक लक्ष द्यायला हवे. स्त्री शिक्षणाचे अनेक फायदे आहेत. शिक्षण प्राप्त करून स्त्री मध्ये आत्मविश्‍वास आणि आत्मसन्मान निर्माण हाेताे. याशिवाय महिलांना शिक्षित केल्यावर कुटुंबाला त्यांचे फायदे हाेतात. शिक्षित महिला नाेकरी करून आपल्या कुटुंबाला आर्थिक मदत करू शकते. शिकलेले स्त्री आपल्या मुलांना कधीही अशिक्षित राहू देणार नाही. लहानपणापासूनच ती आपल्या बाळामध्ये सदगुणांचा संचार करील. आज भारत हा स्त्री शिक्षणात नित्य प्रगती करीत आहे.",

  "भारताला कृषी प्रधान देश म्हटले जाते. भारतीय अर्थव्यवस्थेचा कणा शेती हाच आहे. शेतात काम करणाऱ्‍या व्यक्तीला शेतकरी म्हटले जाते. शेतकरी हा संपूर्ण दिवस शेतात काम करताे, ऊन, वारा, पाऊस इत्यादींची पर्वा न करता आपले कार्य करीत असताे. शेतकरी कठीण परिश्रमाचे प्रतीक आहे. त्याच्यात फार संयम असताे. वर्षभर शेतात काम करून ताे आपल्या कष्टाच्या फळाची वाट पाहत बसताे. शेतकरी आपले जीवन सन्मानाने जगताे. आपले संपूर्ण आयुष्य निसर्गाच्या सानिध्यात घालवताे. शेतकऱ्‍याचे जीवन संतुलिक असते. ताे दरराेज सकाळी लवकर उठताे. दिसभरात त्याला अनेक कामे करायची असतात. सकाळी लवकर उठून तयारी वैगरे करून ताे शेताकउे निघताे. ताे आपला संपूर्ण दिवस शेतातील पिकांची काळजी मध्ये घालवताे. शेत नांगरणे, पीक पेरणे, पिकाला पणी देणे, ऊन वाऱ्‍यापासून आपल्या पिकाचे रक्षण करणे इत्यादी अनेक कामे शेतकऱ्‍याला करावी लागतात. शेतकरी त्याचे पीक अनेक नैसर्गिक आपल्या पासून संरक्षित करताे. पशु, पक्षी, किउे, मुंग्या इत्यादींपासून ताे आपल्या पिकाचे रक्षण करताे. शेतात सुंदर बहरलेल्या पिकामागे शेतकऱ्‍याची शेताविषयीची भक्ती, प्रेम आणि कठीण परिश्रम असते. एक शेतकरी संपूर्ण जगातील मानवाला अन्न पुरविण्यासाठी आपलया जीवन व्यतीत करताे. दिवसभर शेतात काम केल्यावर संध्याकाळी सूर्य मावळल्यांनतर शेतकरी आपल्या घरी पाेहाेचताे. ज्यावेळी ताे घरी पाेचताे तेव्हा ताे अत्यंत थकलेला असताे पण तरीही त्याच्या चेहऱ्‍यावर आनंद दिसत असताे. हा आनंदच त्याच्या कष्टाचे फळ असते. काेणत्याही देशाच्या यशासाठी शेतकऱ्‍यांचे याेगदान फार महत्त्वाचे आह. शेतकरी आपलया प्रयत्नांनी देशाची अर्थव्यवस्था मजबूक करू शकताे. आणि म्हणूनच शेती व शेतकऱ्‍याला अर्थव्यवस्थेचा कणा म्हटले जाते. देशातील शासनाची ही जबाबदारी आहे की त्यांनी शेतकऱ्‍याची याेग्य साेय करायला हवी, जेणेकरून ते काेणत्याही अडथळ्याशिवाय आपले कार्य करू शकतील. शेतकऱ्‍यांना आधुनिक तंत्रज्ञान उपयाेगात आणण्यासाठी शासनाने प्राेत्साहित करायला हवे. आधुनकि पद्धतीने केलेली शेती त्यांना कमी कष्टात जास्तीतचे उत्पन्न मिळवून देऊ शकते. शेतकऱ्‍याचे जीवन आपल्याला अनेक शिकवण देऊन जाते. त्यांचे कठीण परिश्रम आणि संयम आपण सर्वांसाठी एक उदाहरण आहे. आणि म्हणूनच आपण सर्वांची जबाबदारी आहे की आपण शेतकऱ्‍यांना शक्य हाेईल तशी मदत करायला हवी. जर काही कारणास्तव शेतकऱ्‍याचे पीक नष्ट झाले असेल तर त्याला आर्थिक सहाय्य करायला हवे.",

  "मित्रांनाे आजच्या या लेखात आपण खेळांचे महत्व पाहणार आहाेत. जगात काेणताही व्यक्ति असाे त्याने कधी न कधी काेणता न काेणता खेळलेलाच असाते. खेळाचे अनेक फायदे आहेत आणि या लेखाद्वारे मी तुम्हाला तेच फायदे सांगणार आहे. मनुष्याला राेगांपासून दूर राहण्यासाठी निराेगी शरीर असणे आवश्‍यक आहे. एका निराेगी शरीरातून निराेगी मन व बुध्दीचा विकास हाेताे. शरीराला स्वस्थ ठेवण्यासाठी खेळांचे भरपूर महत्त्व आहे. खेळांमुळे शरीर व मन दाेघेही निराेगी राहतात. खेळ खेळल्याने मनुष्यात धैर्य, सहनशीलता आणि मानवी गुणांचा विकास हाेताे. खेळ आजच्या व्यस्त जीवनात महत्त्वाची भूमिका बजावते. खास करून विद्यार्थ्यांच्या जीवनात खेळांचे महत्त्व भरपूर आहे. म्हणून प्रत्येक विद्यार्थ्याला दिवसातून थाेडा वेळ काढून खेळायला हवे. खेळ खेळल्याने तंदुरुस्ती साेबत मनाेरंजनही हाेते. काेणताही खेळ खेळल्याने व्यक्तीचा शारीरिक विकासासाेबत मानसिक विकासही हाेताे. खेळताना डाेळे, मेंदू व शरीराच्या प्रत्येक अवयवाचा वापर करावा लागताे. खेळांमुळे शरीराचे संतुलनही वाढते. नियमि काेणतातरी खेळ खेळल्याने चित्त प्रसन्न राहते. शरीरिक अवयवांचा व्यवस्थित विकास हाेताे. मनाल उल्हास आणि उत्साह वाढून आयुष्यातील प्रत्येक क्षेत्रात यशे मिळते. खेळांचे देखील वेगवेगळे प्रकार असतात काही खेळ शारीरिक तर काही मानसिक असतात. शारीरिक खेळ खेळण्यासाठी शरीराल श्रम करावे लागते, तर मानसिक खेळांमध्ये मेंदूचे कार्य असते. फुटबाॅल, हाॅकी, व्हाॅलीबाॅल, कि्रकेट, टेनिस, कबड्डी इत्यादी शारीरिक खेळ आहेत. या खेळांना खेळण्यासठी मानसिक शारीरिक ताकत लागते. दुसरीकडे बुद्धीबळ, पत्ते, चाैपट इत्यादी मानसिक खेळ आहेत, ज्यांना खेळण्यासाठी मानसिक शक्तीचा वापर करावा लागताे. या शिवाय इनडाेर आणि आऊटडाेर खेळांचे प्रकार आहेत. आजकाल इनडाेर खेळांमध्ये काॅम्प्यूटर व माेबाईल गेम्स माेठ्या प्रमाणत खेळले जात आहेत. परंतु हे खेळ तुमचे स्वस्थ सुधारणा ऐवजी बिघडवित आहेत. बाहेर खेळाला जाणार खेळ काेणताही असाे ताे आपल्या शरीराला स्वस्थ आणि मनाला प्रसन्न करताे. खेळ मनुष्याचा व्यक्तिमत्त्व विकास करतात. ते एकमेकांमध्ये सहकार्य व बंधूता वाढवतात. खेळांमुळे परंपरा सन्मान आणि प्रेम देखील वाढते. अश्‍या पद्धतीने खेळ आपलयाला गुणवान, चारित्र्यवान आणि एक खरा व्यक्ती बनवतात.",

  "मी वाचलेल्या व मला सर्वाधिक प्रिय असणाऱ्‍या पुस्तकाचे नाव अग्निपंख आहे. हे पुस्तक भारताचे भूतपूर्व राष्ट्रपती डाॅक्टर एपीजे अब्दुल कलाम यांनी लिहिले आहे. अग्निपंख ही एपीजे अब्दुल कलाम यांची आत्मकथा आहे. या पुस्तकात अब्दुल कलाम यांच्या बालपणापासून तर राष्ट्रपति पदापर्यंतचा संपूर्ण प्रवास रचण्यात आला आहे. डाॅक्टर अब्दुल कलाम भारताच्या यशस्वी शास्त्रज्ञापैकी एक आहेत. त्यांनी इंडियन स्पेस रिसर्च ऑर्गनायझेशन मध्ये महत्त्वाचे याेगदान दिले. भारताची सैन्य क्षमता वाढविण्यासाठी त्यांनी अनुचाचणी घेतली म्हणूनच त्यांना मिसाईल मेन म्हणूनही संबाेधले जाते. २००२ सालापर्यंत ते अत्यंत लाेकपि्रय झाले हाेते. म्हणूनच त्यांना भारताच्या राष्ट्रपतीपदासाठी निवडण्यात आले. अग्निपंख या पुस्तकात अब्दुल कलाम यांनी यांचे बालपणचे जीवन ते राष्ट्रपती पदासाठी करण्यात आलेली निवड पर्यंतचा संपूर्ण जीवन परिचय रेखाटला आहे. या चारित्र्याची सुरुवत एका लहान मुलापासून हाेते जाे नंतर इस्त्राे चा प्रसिद्ध शास्त्रज्ञ आणि भारताचे राष्ट्रपती बनताे. मला या पुस्तकातील सुरुवातीचे धडे जास्तीत आवडले कारण या धड्यांमध्ये भारताच्या १९३०-१९५० या कालखंडातील परिस्थिचे चित्रण करण्यात आले आहे. अब्दुल कलाम यांचा जन्म धार्मिक नगरी रामेश्‍वरम मधील एका मुस्लिम कुटुंबात झाला. भारताच्या विभाजनापूर्वी असलेली देशातील धार्मिक एकता आणि एकत्मतेचे वर्णन अब्दुल कलाम यांनी पहिल्या दाेन धड्यांमध्ये केले आहे. अब्दुल कलमा यांनी आपल्या पुस्तकात लिहिले आहे की लहान असताना त्यांचे स्वप्न पायलट बनण्याचे हाेते. परंतु पायलट साठी असलेली इंटरव्यू परीक्षा ते अनुत्तीर्ण झाले. परंतु निराश न हाेता त्यांनी दुसऱ्‍या क्षेत्रात आले करियर सुरू केले. पुस्तकात सांगितल्याप्रमाण्र कलाम यांनी सुरवातीला विमान बनवण्याचे क्षेत्रात कार्य केले. नंतर ते भारतीय अंतराक्ष संस्था इस्त्राे कडे वळले. अग्निपंख पुस्तकात अब्दुल कलाम यांनी यशस्वीपणे पूर्ण केलेले सॅटॅलाइटआणि मिसाइल कार्यक्रमांची माहिती देण्यात आली आहे. अग्नी, आकाश, पृथ्वी, त्रिशूल, नाग या घराेघरी पाेहाेचलेल्या नावांच्या क्षेपणास्त्रांची जडणघडणही फार सुंदरपणे वाचकांना सांगितलेली आहे. हे पुस्तक केवळ डाॅ. अब्दुल कलाम यांचे आत्मचरित्र नसून स्वतंत्र भारताच्या तंत्रज्ञानविषयक लढाईचे एक स्पंदन आहे.जागतिक शस्त्रस्पर्धेच्या राजकारणाची आणि विज्ञानाची ती काहणी आहे. तसेच स्वयंपूर्ण हाेण्यासाठी आपल्या देशाने केलेल्या संघर्षाचे ते मनाेहारी खंडकाव्यही आहे.",
];

const sentencesArrayEnglish = [
  "Climate change, driven by human activities such as the burning of fossil fuels and deforestation, results in rising global temperatures and extreme weather events. Understanding the science behind climate change and adopting sustainable practices is crucial for mitigating its impact"
];

const sentencesArrayHindi = [
  "हिमालय की चोटियाँ, बादलों के बीच छिपी हुई, सफेद चादर की तरह चमकती हैं। उनकी ऊंचाई और भव्यता देखने वाले को मंत्रमुग्ध कर देती है। इन पहाड़ों की छाँव में बसे गाँवों में जीवन शांत और सरल है। लोग यहाँ की प्राकृतिक सुंदरता के बीच रहकर एक सुखी और संतुष्ट जीवन जीते हैं।",
];

// ALL ELEMENTS TO BE USED
const result = document.getElementById("result");
const UserInput = document.getElementById("UserInput");
const backspaceSpan = document.getElementById("backspace");
const keyStrokeSpan = document.getElementById("keystroke");
const contentLengthSpan = document.getElementById("contLength");
const mistakesSpan = document.getElementById("mistakes");
var secondsRemaining;
var intervalId;
var selectedlang = "";
var EnglishTextReal = "";
var back_space_count = 0;
var textToType="";

function getc(lang, speed) {
  // console.log(lang + " , " + speed );
  selectedlang = lang;
  renderNewQuote(lang);
}


// FUNCTION TO RENDER NEW QUOTE to display
const renderNewQuote = (selectedlang) => {
    UserInput.value = ""; //to clear textarea
    if (selectedlang === "Marathi") {
      const randomIndex = Math.floor(
        Math.random() * sentencesArrayMarathi.length
      );
      textToType = sentencesArrayMarathi[randomIndex];
    } else if (selectedlang === "Hindi") {
      const randomIndex = Math.floor(Math.random() * sentencesArrayHindi.length);
      textToType = sentencesArrayHindi[randomIndex];
    } else {
      const randomIndex = Math.floor(
        Math.random() * sentencesArrayEnglish.length
      );
      textToType = sentencesArrayEnglish[randomIndex];
      UserInput.disabled = false;
    }
    // console.log(textToType);
    const seperator_wor = textToType.split(/\s+/);
    // const seperator_word = splitWords(seperator_wor);
  
    // console.log(seperator_word);
  
    // Iterate through the words and create <span> elements
    var span_id = 0;
    for (const word of seperator_wor) {
      const spanElement = document.createElement("span");
      spanElement.textContent = word + " "; // Add a space after each word
      spanElement.id = "w" + span_id;
      result.appendChild(spanElement);
      span_id++;
    }
    // result.innerHTML = textToType;
  };

  var key_stroke_count = 0;
  let startTime;
let timerInterval;
const totalTimeInSeconds = 600; // 10 minutes

function startTimer() {
  // Check if the timer is already running
  if (!startTime) {
    startTime = new Date().getTime();
    timerInterval = setInterval(updateTimer, 1000);
  }
}
function stopTimer() {
  if (startTime) {
    clearInterval(timerInterval);
    startTime = null; // Reset startTime to indicate the timer has stopped
  }
}

function updateTimer() {
    const currentTime = new Date().getTime();
    const elapsedTimeInSeconds = Math.floor((currentTime - startTime) / 1000);
    const remainingTimeInSeconds = totalTimeInSeconds - elapsedTimeInSeconds;
  
    if (remainingTimeInSeconds <= 0) {
      // Timer reached 0, stop the timer
      clearInterval(timerInterval);
      document.getElementById("countdown").textContent = "Time: 0:00";
      alert("Time's up! Submit your test.");
      handle_submit();
      // Additional actions when the timer reaches 0
      // You can customize this part based on your requirements
    } else {
      // Format minutes and seconds
      const minutes = Math.floor(remainingTimeInSeconds / 60);
      const seconds = remainingTimeInSeconds % 60;
  
      document.getElementById("countdown").textContent = `${minutes}:${
        seconds < 10 ? "0" : ""
      }${seconds}`;
    }
  }
   // main code FOR ENGLISH start here
UserInput.addEventListener("input", function (event) {
    startTimer();
    // to count keystorke
    key_stroke_count++;
    keyStrokeSpan.textContent = key_stroke_count;
    // console.log("key_stroke_count",key_stroke_count)
  
    //MAKE THE SELECTED PARA INTO ARRAY OF WORDS
    expectedWords = textToType.split(" ");
    // To count the length of para
    const lengthCount = expectedWords.length;
    contentLengthSpan.textContent = lengthCount;
  
    // For Engkish language
    if (selectedlang === "English") {
      //MAKE USER INPUT INTO ARRAY OF WORDS
      const userWords = UserInput.value.split(" ");
  
      let feedback = "";
  
      if (event.inputType == "deleteContentBackward") {
        // To count backspace
        back_space_count = back_space_count + 1;
        backspaceSpan.textContent = back_space_count;
      }
    }
  
    //******/ For Marathi Language***************
    else {
      const text = UserInput.value;
      if (event.inputType == "deleteContentBackward") {
        // To count backspace
        back_space_count = back_space_count + 1;
        backspaceSpan.textContent = back_space_count;
        key_stroke_count--;
        keyStrokeSpan.textContent = key_stroke_count;
  
        // to work backSpace in marathi input
        let difference = EnglishTextReal.length - 1;
        EnglishTextReal = EnglishTextReal.slice(0, difference);
      } else {
        EnglishTextReal += text.substring(text.length - 1);
      }
  
      var changed = convertToMarathi(UserInput.value);
  
      UserInput.value = changed;
  
      //MAKE USER INPUT INTO ARRAY OF WORDS
      const userWords = changed.split(" ");
      console.log(userWords.length, "userWords.length");
      //   console.log("CONVERTED ARRAT-> " + userWords)
      let feedback = "";
    }
  
    // TO disabale more than one space
    UserInput.addEventListener("keydown", function (event) {
      if (event.key === " " && UserInput.value.slice(-1) === " ") {
        event.preventDefault();
      }
    });
  });

  function convertToMarathi(englishText) {
    // console.log("ebgtext",englishText);
    const remingtonMapping = {
      q: "ु",
      w: "ू",
      e: "म",
      r: "त",
      t: "ज",
      y: "ल",
      u: "न",
      i: "प",
      o: "व",
      p: "च",
      a: "ं",
      s: "े",
      d: "क",
      f: "ि",
      g: "ह",
      h: "ी",
      j: "र",
      k: "ा",
      l: "स",
      z: "्र",
      x: "ग",
      c: "ब",
      v: "अ",
      b: "इ",
      n: "द",
      m: "उ",
      "~": "द्य",
      "`": "़",
      1: "१",
      2: "२",
      3: "३",
      4: "४",
      5: "५",
      6: "६",
      7: "७",
      8: "८",
      9: "९",
      0: "०",
      "-": "ञ",
      _: ".",
      "=": "ृ",
      "\\": ".",
      "[": "ख्",
      "]": ",",
      ";": "य",
      "?": "घ्‍",
      ",": "ए",
      ".": "ण्",
      "/": "ध्",
      Q: "फ",
      W: "ॅ",
      E: "म्",
      R: "त्",
      T: "ज्",
      Y: "ल्",
      U: "न्",
      I: "प्",
      O: "व्",
      P: "च्",
      A: "ा",
      S: "ै",
      D: "क्",
      F: "थ्",
      G: "ळ",
      H: "भ्",
      J: "श्र",
      K: "ज्ञ",
      L: "स्",
      Z: "र्",
      X: "ग्",
      C: "ब्",
      V: "ट",
      B: "ठ",
      N: "छ",
      M: "ड",
      "`": "़",
      "!": "|",
      "@": "/",
      "#": ":",
      $: "ऱ्‍",
      "%": "-",
      "^": "“",
      "&": "‘",
      "*": "द्ध",
      "(": "त्र",
      ")": "ऋ",
      "+": "्",
      "|": "\\",
      "{": "क्ष्",
      "}": "द्व",
      ":": "रू",
      '"': "ष्",
      "<": "ढ",
      ">": "झ्",
      "?": "घ्",
      '"': "ष्",
      "'": "श्‍",
    };
  
    const half_letter = {
      H: "भ",
      E: "म",
      R: "त",
      T: "ज",
      Y: "ल",
      U: "न",
      I: "प",
      O: "व",
      P: "च",
  
      "[": "ख",
      "{": "क्ष",
      D: "क",
      F: "थ",
      L: "स",
      '"': "ष",
      "'": "श",
      X: "ग",
      C: "ब",
      v: "आ",
      ".": "ण",
      "?": "घ",
      "/": "ध",
      ">": "झ",
    };
  
    const half_letter_rafar = {
      F: "र्थ",
      H: "र्भ",
      '"': "र्ष ",
      "'": "र्श ",
      ".": "र्ण",
      "?": "र्घ",
      "/": "र्ध",
      "{": "र्क्ष",
      "[": "र्ख ",
    };
  
    const half_letter_rafar_keys = Object.keys(half_letter_rafar);
    // con
    const half_letter_keys = Object.keys(half_letter);
    const a = [];
    let z = 0;
  
    const EnglishWords = EnglishTextReal.split(" ");
  
    for (let i = 0; i < EnglishTextReal.length; i++) {
      console.log("LOOP KRAMANK-> " + i + " -> " + a);
      console.log("(EnglishTextReal", EnglishTextReal);
  
      // for half letter and full letter rafar
      if (
        EnglishTextReal[i - 1] == "k" &&
        EnglishTextReal[i] == "Z" &&
        EnglishTextReal[i - 2] != " " &&
        EnglishTextReal[i - 2] != undefined
      ) {
        if (half_letter_keys.includes(EnglishTextReal[i - 2])) {
          const position1 = half_letter_keys.indexOf(EnglishTextReal[i - 2]);
          a[i - 2] =
            remingtonMapping[EnglishTextReal[i]] +
            half_letter[half_letter_keys[position1]];
          console.log("BOOOOOO " + a[i - 2]);
  
          i++;
        } else {
          a[i - 2] =
            remingtonMapping[EnglishTextReal[i]] +
            remingtonMapping[EnglishTextReal[i - 2]];
          console.log("in rafar with kana", a[i - 2]);
          i++;
        }
      }
  
      // for rafar with pahili velanti
  
      if (
        EnglishTextReal[i - 2] == "f" &&
        EnglishTextReal[i] == "Z" &&
        EnglishTextReal[i - 1] != " " &&
        EnglishTextReal[i - 1] != undefined
      ) {
        a[i - 2] =
          remingtonMapping[EnglishTextReal[i]] +
          remingtonMapping[EnglishTextReal[i - 1]] +
          remingtonMapping[EnglishTextReal[i - 2]];
  
        console.log("in rafar with pahili velanti", a[i - 2]);
        i++;
      }
  
      //  for rafar with dusri velanti
      if (
        EnglishTextReal[i - 1] == "h" &&
        EnglishTextReal[i] == "Z" &&
        EnglishTextReal[i - 2] != " " &&
        EnglishTextReal[i - 2] != undefined
      ) {
        a[i - 2] =
          remingtonMapping[EnglishTextReal[i]] +
          remingtonMapping[EnglishTextReal[i - 2]];
        console.log("in rafar with  dusri velanti", a[i]);
        i++;
      }
  
      // for velanti of half lettr velanti
      if (
        EnglishTextReal[i] != "" &&
        EnglishTextReal[i] != "k" &&
        half_letter_keys.includes(EnglishTextReal[i - 1]) &&
        EnglishTextReal[i - 2] === "f"
      ) {
        var joiner =
          remingtonMapping[EnglishTextReal[i - 1]] +
          remingtonMapping[EnglishTextReal[i]] +
          remingtonMapping[EnglishTextReal[i - 2]];
        a[i - 2] = joiner;
        console.log("hurrey NAVIN " + joiner);
      }
  
      // FOR PAHILE VELANTI
      else if (
        EnglishTextReal[i] === "k" &&
        half_letter_keys.includes(EnglishTextReal[i - 1]) &&
        EnglishTextReal[i - 2] === "f"
      ) {
        console.log("hurrey");
        const position = half_letter_keys.indexOf(EnglishTextReal[i - 1]);
        var temp =
          half_letter[half_letter_keys[position]] +
          remingtonMapping[EnglishTextReal[i - 2]];
        a[i - 2] = temp;
        console.log("hurrey" + temp);
        // i++
      } else if (
        EnglishTextReal[i] == "f" &&
        EnglishTextReal[i + 1] != " " &&
        remingtonMapping[EnglishTextReal[i + 1]] != undefined
      ) {
        a[i] =
          remingtonMapping[EnglishTextReal[i + 1]] +
          remingtonMapping[EnglishTextReal[i]];
        i++;
        console.log("PRIMARY IF");
      }
      //FOR half letter and kana and AA
      else if (
        half_letter_keys.includes(EnglishTextReal[i]) &&
        (EnglishTextReal[i + 1] == "k" || EnglishTextReal[i + 1] == "A")
      ) {
        console.log("in 2nd if");
        const position = half_letter_keys.indexOf(EnglishTextReal[i]);
        a[i] = "";
        a[i] = half_letter[half_letter_keys[position]];
        console.log("SECONDARY IF  for AA ", a[i]);
        i++;
      }
      // for "ओ"
      else if (
        EnglishTextReal[i - 2] == "v" &&
        EnglishTextReal[i - 1] == "k" &&
        EnglishTextReal[i] == "s"
      ) {
        a[i - 2] = "ओ";
        console.log("in ओ");
      }
      // for ऊ
      else if (EnglishTextReal[i] == "m" && EnglishTextReal[i + 1] == "Q") {
        // initialize only for ऊ
        console.log("in ऊ");
        a[i] = "ऊ";
        i++;
      }
      //   for rafar of jodshabda and purna shbda rafar
      else if (
        EnglishTextReal[i] == "Z" &&
        EnglishTextReal[i - 1] != " " &&
        remingtonMapping[EnglishTextReal[i - 1]] != undefined
      ) {
        // for jodshabda
        if (half_letter_keys.includes(EnglishTextReal[i - 2])) {
          console.log("in jeeee ", EnglishTextReal[i - 2]);
          console.log(
            "for if wala rafar ",
            EnglishTextReal[i],
            EnglishTextReal[i - 1],
            EnglishTextReal[i - 2]
          );
          console.log(
            remingtonMapping[EnglishTextReal[i]],
            remingtonMapping[EnglishTextReal[i - 1]],
            remingtonMapping[EnglishTextReal[i - 2]]
          );
          a[i - 2] =
            remingtonMapping[EnglishTextReal[i]] +
            remingtonMapping[EnglishTextReal[i - 2]];
        } else {
          // for sadha rafar
          console.log("in else");
          a[i - 1] =
            remingtonMapping[EnglishTextReal[i]] +
            remingtonMapping[EnglishTextReal[i - 1]];
          console.log(EnglishTextReal[i], EnglishTextReal[i - 1]);
        }
        console.log("in rafar");
      } else if (
        // in big rafar
        EnglishTextReal[i] == "Z" &&
        EnglishTextReal[i - 1] == "k" &&
        remingtonMapping[EnglishTextReal[i - 1]] != undefined
      ) {
        a[i] =
          remingtonMapping[EnglishTextReal[i]] +
          remingtonMapping[EnglishTextReal[i - 1]];
      }
  
      // for big "E"
      else if (EnglishTextReal[i] == "b" && EnglishTextReal[i + 1] == "Z") {
        a[i] = "ई";
        console.log("in ई ");
        i++;
      }
  
      // if (
      //   half_letter_rafar_keys .includes(EnglishTextReal[i]) &&
      //   (EnglishTextReal[i + 1] == "k" && EnglishTextReal[i + 2] == "Z")
      // ) {
      //   console.log("in 2nd if");
      //   const position = half_letter_rafar_keys.indexOf(EnglishTextReal[i]);
      //   a[i] = "";
      //   a[i] =  half_letter_rafar[half_letter_rafar_keys[position]];
      //   i++;
      //   console.log("in rafar with kana hurreyyyyyyy ??...");
      // }
  
      // for rafar with kana
      // else if (
      //   EnglishTextReal[i - 1] == "k" &&
      //   EnglishTextReal[i] == "Z" &&
      //   EnglishTextReal[i - 2] != " " &&
      //   EnglishTextReal[i - 2] != undefined
      // ) {
      //   a[i - 2] =
      //     remingtonMapping[EnglishTextReal[i]] +
      //     remingtonMapping[EnglishTextReal[i - 2]];
      //   console.log("in rafar with velantiyyyy", a[i]);
      //   i++;
      // }
  
      //FOR NORMAL
      else {
        a[i] = remingtonMapping[EnglishTextReal[i]] || EnglishTextReal[i];
        console.log("in sadha loop", a[i], a[i - 1]);
      }
    }
  
    return a.join("");
  }

  function compareWords() {
    var data = document.getElementById("UserInput").value;
    // console.log(data);
    // console.log(textToType);

    var dmp = new diff_match_patch();

    // var text1 = "हा एक उदाहरण आहे";
    // var text2 = "हे एक संपादित उदाहरण आहे";

    // Compute the diff
    var diff = dmp.diff_main(textToType,data);

    // Optional: improve the readability of the diff
    dmp.diff_cleanupEfficiency(diff);

    var uc = "";
    // Display the diff
    diff.forEach(function (part) {
    var operation = part[0]; // Operation (0: equal, -1: deletion, 1: insertion)
    var text = part[1]; // Text of this part
    var type =
        operation === 1 ? "Inserted" : operation === -1 ? "Deleted" : "Unchanged";

        if(type === "Unchanged"){
            uc += text;
        }
    console.log(type + ": " + text);
    });

    console.log("UNC-> " + uc);
    const ts = uc.split(" ");
    console.log(ts);
  }


